[
  {
    "course_code": "CICS 160",
    "title": "Object-Oriented Programming",
    "instructors": [
      "Jaime Davila",
      "Cole Reilly"
    ],
    "description": "This course will expose students to programming practices beyond the introductory level, concentrating on Object Oriented Programming techniques and an introduction to Data Structures. Students will also study and analyze the complexity of both the algorithms presented in class and of the algorithms they develop.",
    "prerequisites": [
      "CICS 110 or COMPSCI 121 with a grade of C or better"
    ],
    "credits": 4
  },
  {
    "course_code": "CICS 210",
    "title": "Data Structures",
    "instructors": [
      "Mordecai Golin",
      "Timothy Richards"
    ],
    "description": "An introduction to the design, analysis, and implementation of data structures. Topics include binary search trees, balanced trees, priority queues, hash tables, graphs, and more. Students will learn to analyze the performance of algorithms using Big-O notation.",
    "prerequisites": [
      "CICS 160 with a grade of C or better"
    ],
    "credits": 4
  },
  {
    "course_code": "CICS 256",
    "title": "Make: A Hands-on Introduction to Physical Computing",
    "instructors": [
      "Stefan Krastanov"
    ],
    "description": "This course provides a hands-on introduction to physical computing with Arduinos, sensing and responding to the physical world, and rapid prototyping. A required lab section is included.",
    "prerequisites": [
      "CICS 210 or COMPSCI 187 with a grade of C or better"
    ],
    "credits": 4
  },
  {
    "course_code": "CICS 305",
    "title": "Social Issues in Computing",
    "instructors": [
      "Erin Butler",
      "Elizabeth Gunther",
      "Siobhan Mei",
      "Justin Obara",
      "Matthew Ross",
      "Christina Sutcliffe"
    ],
    "description": "A discussion-based course on computing issues in modern society, exploring topics such as ethics, privacy, and the impact of technology.",
    "prerequisites": [
      "ENGLWRIT 112 with a grade of C or better",
      "COMPSCI 220",
      "COMPSCI 230",
      "COMPSCI 240"
    ],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 119",
    "title": "Introduction to Programming",
    "instructors": [
      "Devdhar Patel"
    ],
    "description": "An introduction to computer programming using Python, covering data types, program structures, functions, debugging, and object-oriented programming.",
    "credits": 3
  },
  {
    "course_code": "COMPSCI 198C",
    "title": "Practicum - Introduction to the C Programming Language",
    "instructors": [
      "Meng-Chieh Chiu",
      "Timothy Richards"
    ],
    "description": "Covers basic C data types, functions, pointers, and memory management. Students learn to compile and run C programs.",
    "prerequisites": [
      "CICS 160 or COMPSCI 121 with a grade of B or better"
    ],
    "credits": 1
  },
  {
    "course_code": "COMPSCI 220",
    "title": "Programming Methodology",
    "instructors": [
      "Marius Minea"
    ],
    "description": "Covers design strategies and patterns, functional and object-oriented approaches, program verification, and testing.",
    "prerequisites": [
      "CICS 210 with a grade of C or better"
    ],
    "credits": 4
  },
  {
    "course_code": "COMPSCI 230",
    "title": "Computer Systems Principles",
    "instructors": [
      "Phuthipong Bovornkeeratiroj",
      "Meng-Chieh Chiu"
    ],
    "description": "A study of high-performance, scalable systems, C data representation, assembly languages, operating system services, and synchronization.",
    "prerequisites": [
      "CICS 210 with a grade of C or better",
      "COMPSCI 198C"
    ],
    "credits": 4
  },
  {
    "course_code": "COMPSCI 311",
    "title": "Introduction to Algorithms",
    "instructors": [
      "Marius Minea",
      "Daniel Sheldon"
    ],
    "description": "Covers algorithm design techniques such as divide and conquer, greedy methods, dynamic programming, and network flow.",
    "prerequisites": [
      "CICS 210",
      "COMPSCI 250 or MATH 455 with a grade of C or better"
    ],
    "credits": 4
  },
  {
    "course_code": "COMPSCI 320",
    "title": "Introduction to Software Engineering",
    "instructors": [
      "Gordon Anderson",
      "Jaime Davila",
      "Matthew Rattigan"
    ],
    "description": "Focuses on team-based software engineering projects covering design, abstraction, testing, and project management.",
    "prerequisites": [
      "COMPSCI 220 with a grade of C or better"
    ],
    "credits": 4
  },
  {
    "course_code": "COMPSCI 326",
    "title": "Web Programming",
    "instructors": [
      "Meng-Chieh Chiu"
    ],
    "description": "Introduction to client-side and server-side web technologies, including JavaScript, AJAX, web security, and web frameworks.",
    "prerequisites": [
      "COMPSCI 220 or COMPSCI 230 with a grade of C or better"
    ],
    "credits": 4
  },
  {
    "course_code": "COMPSCI 360",
    "title": "Introduction to Computer and Network Security",
    "instructors": [
      "Eugene Bagdasarian"
    ],
    "description": "Covers cryptography, privacy, network security, security vulnerabilities, and countermeasures.",
    "prerequisites": [
      "COMPSCI 230 with a grade of C or better"
    ],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 367",
    "title": "Reverse Engineering and Understanding Exploit Development",
    "instructors": ["Lurene Grenier"],
    "description": "Covers practical skills in reverse engineering and binary exploitation, including vulnerability analysis and mitigation techniques.",
    "prerequisites": ["COMPSCI 230 (or E&C-ENG 322 or E&C-ENG 373) with a grade of C or better, or permission of instructor"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 370",
    "title": "Introduction to Computer Vision",
    "instructors": ["Subhransu Maji"],
    "description": "Covers algorithms for image processing, object recognition, and machine learning applications in vision.",
    "prerequisites": ["COMPSCI 240 or 383 with a grade of C or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 373",
    "title": "Introduction to Computer Graphics",
    "instructors": ["Rui Wang"],
    "description": "Introduces 2D and 3D computer graphics, including modeling, rendering, shading, and ray tracing.",
    "prerequisites": ["CICS 210 (or COMPSCI 187) and MATH 235 (or INFO 150 or COMPSCI 240) with a grade of C or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 377",
    "title": "Operating Systems",
    "instructors": ["Phuthipong Bovornkeeratiroj"],
    "description": "Examines the design and implementation of modern operating systems, including processes, memory management, and file systems.",
    "prerequisites": ["COMPSCI 230 with a grade of C or better"],
    "credits": 4
  },
  {
    "course_code": "COMPSCI 383",
    "title": "Artificial Intelligence",
    "instructors": ["William McNichols"],
    "description": "Provides an introduction to AI topics, with a focus on machine learning, search algorithms, and neural networks.",
    "prerequisites": ["CICS 210 and COMPSCI 240 (or STATISTC 315), all with a grade of C or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 389",
    "title": "Introduction to Machine Learning",
    "instructors": ["Philip Thomas"],
    "description": "An introduction to machine learning algorithms including supervised learning, reinforcement learning, and deep learning concepts.",
    "prerequisites": ["COMPSCI 220 (or COMPSCI 230), COMPSCI 240 (or STATISTC 315/515), and MATH 233, all with a grade of C or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 390B",
    "title": "Harnessing Data Science for Societal Good",
    "instructors": ["Abhidip Bhattacharyya"],
    "description": "Project-based course on data science applications in societal problems like sustainability and healthcare.",
    "prerequisites": ["COMPSCI 230 and COMPSCI 240 (or STATISTC 315/515) with a grade of C or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 403",
    "title": "Introduction to Robotics: Perception, Mechanics, Dynamics, and Control",
    "instructors": ["Donghyun Kim"],
    "description": "Covers robotic motion, kinematics, dynamics, and feedback control with programming in Python.",
    "prerequisites": ["MATH 235 and COMPSCI 220 (or COMPSCI 230) with a grade of C or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 420",
    "title": "Software Entrepreneurship",
    "instructors": ["Matthew Rattigan"],
    "description": "Focuses on developing software from proof-of-concept to marketable products with societal benefits.",
    "prerequisites": ["COMPSCI 320 (or COMPSCI 326) with a grade of C or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 426",
    "title": "Scalable Web Systems",
    "instructors": ["Timothy Richards"],
    "description": "Covers large-scale web applications, software architecture, scalability, and distributed systems.",
    "prerequisites": ["COMPSCI 320 or COMPSCI 326 with a grade of C or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 429",
    "title": "Software Engineering Project Management",
    "instructors": ["Gordon Anderson", "Jaime Davila", "Matthew Rattigan"],
    "description": "Provides practical experience in managing software development projects for teams.",
    "prerequisites": ["COMPSCI 320 with a grade of B or better, or instructor permission"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 445",
    "title": "Information Systems",
    "instructors": ["Trek Palmer"],
    "description": "This course is an introduction to the efficient management of large-scale data. The course includes principles for representing information as structured data, query languages for analyzing and manipulating structured data, and core systems principles that enable efficient computation on large data sets. Classical relational database topics will be covered (data modeling, SQL, query optimization, concurrency control), as well as semi-structured data (XML, JSON), and distributed data processing paradigms (e.g. MapReduce and Spark). Additional application topics may include web application development, data integration, processing data streams, database security and privacy. This course counts as an Elective toward the CS Major.",
    "prerequisites": ["COMPSCI 220 (or 230) and COMPSCI 311 and COMPSCI 345 with a grade of C or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 446",
    "title": "Search Engines",
    "instructors": ["Razieh Rahimi"],
    "description": "This course provides an overview of the important issues in information retrieval, and how those issues affect the design and implementation of search engines. The course emphasizes the technology used in Web search engines, and the information retrieval theories and concepts that underlie all search applications. Mathematical experience (as provided by COMPSCI 240) is required. You should also be able to program in Java or Python (other closely related languages may be acceptable). This course counts as a CS Elective for the CS Major.",
    "prerequisites": ["COMPSCI 240 or COMPSCI 383 with a grade of C or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 453",
    "title": "Computer Networks",
    "instructors": ["Arun Venkataramani"],
    "description": "This course provides an introduction to fundamental concepts in the design and implementation of computer networks, their protocols, and applications with a particular emphasis on the Internet's TCP/IP protocol suite. Topics to be covered include: overview of network architectures, applications, network programming interfaces (e.g., sockets), transport, congestion, routing, and data link protocols, addressing, local area networks, wireless networks, network security, and network management. There will be five or six homeworks, two programming projects, several hands-on labs (that require an Internet-connected personal computer) and two exams. This course counts as a CS Elective for the CS Major.",
    "prerequisites": ["COMPSCI 230 (or COMPSCI 377) with a grade of C or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 466",
    "title": "Applied Cryptography",
    "instructors": ["Adam O'Neill"],
    "description": "This is an undergraduate-level introduction to cryptography. It is a theory course with a significant mathematical component. However, our viewpoint will be theory applied to practice in that we will aim to treat topics in a way of applied value. We will discuss cryptographic algorithms used in practice and how to reason about their security. More fundamentally, we will try to understand what security is in a rigorous way that allows us to follow sound principles and uncover design weaknesses. The primary topics are: blockciphers, pseudorandom functions, symmetric-key encryption schemes, hash functions, message authentication codes, public-key encryption schemes, digital signature schemes, and public-key infrastructures. This course counts as a CS Elective toward the CS Major.",
    "prerequisites": ["COMPSCI 311 with a grade of C or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 491G",
    "title": "Seminar - Computer Networking Lab",
    "instructors": ["Parviz Kermani"],
    "description": "In this course, students will learn how to put 'principles into practice,' in a hands-on-networking lab course. The course will cover router, switches and end-system labs in the areas of Single Segment IP Networks, Multiple Segment IP Networks and Static Routing, Dynamic Routing Protocols (RIP, OSPF and BGP), LAN switching, Transport Layer Protocols: UDP and TCP, NAT, DHCP, DNS, and SNMP. Students will also get engaged in evaluating power consumption of network components as an aid in the design of energy efficient (green) networks. This course counts as a CS Elective for the CS Major.",
    "prerequisites": ["COMPSCI 453 with a grade of C or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 496C",
    "title": "Independent Study - Social Entrepreneurship Launchpad",
    "instructors": ["Matthew Rattigan"],
    "description": "Social Entrepreneurship Launchpad offers a team-based opportunity to students who are committed to launching marketable products that contribute to the common good. Teams test the commercial potential of their product ideas and receive mentoring and guidance from CICS Entrepreneurs in Residence (EIRs) and industry partners to secure funding, build a marketing plan, and consolidate a customer base. The course is open by permission of the instructor to students who have successfully completed either COMPSCI 420 or have equivalent academic or industry experience. This course does not count as either a CS or INFORM Elective.",
    "prerequisites": ["COMPSCI 420 with a grade of C or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 496D",
    "title": "Independent Study - Machine Learning Applied to Child Rescue",
    "instructors": ["Brian Levine"],
    "description": "Students will work collaboratively to construct production-grade software used to advance the goal of Child Rescue. This course is a group-based, guided independent study. Our goal is to build software that leverages practical machine learning models to be used by professionals dedicated to rescuing children from abuse. Students will be encouraged to design and build their own diagnostic and machine learning tools, while also learning from professionals in the fields of digital forensics and law enforcement. An emphasis is placed on practicing real-world professional software engineering skills, such as dealing with limiting scope, productionization concerns, and working in the presence of poorly defined problems.",
    "prerequisites": ["COMPSCI 383 with a grade of C or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 501",
    "title": "Formal Language Theory",
    "instructors": ["David Barrington"],
    "description": "Introduction to formal language theory. Topics include finite state languages, context-free languages, the relationship between language classes and formal machine models, the Turing Machine model of computation, theories of computability, resource-bounded models, and NP-completeness. This course counts as a CS Elective for the CS Major.",
    "prerequisites": ["COMPSCI 311 with a grade of C or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 508",
    "title": "Ethical Considerations in Computing",
    "instructors": ["Michelle Trim"],
    "description": "This course considers an array of ethical issues in computing. Readings and class discussions will cover ethical questions related to artificial intelligence, privacy online, identity in computing, electronic surveillance, environmental responsibility, internet censorship, network policy, algorithmic systems, information access, ownership of intellectual property in computing contexts, and others. All examples will be drawn from current and recent events with readings from a range of sources both journalistic and academic.",
    "prerequisites": [],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 514",
    "title": "Algorithms for Data Science",
    "instructors": ["Andrew McGregor"],
    "description": "With the advent of social networks, ubiquitous sensors, and large-scale computational science, data scientists must deal with data that is massive in size, arrives at blinding speeds, and often must be processed within interactive or quasi-interactive time frames. This course studies the mathematical foundations of big data processing, developing algorithms and learning how to analyze them.",
    "prerequisites": ["COMPSCI 240 (or STATISTICS 315/515) and COMPSCI 311 both with a grade of B+ or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 520",
    "title": "Theory and Practice of Software Engineering",
    "instructors": ["Heather Conboy"],
    "description": "Introduces students to the principal activities and state-of-the-art techniques involved in developing high-quality software systems. Topics include: requirements engineering, formal specification methods, design principles & patterns, verification & validation, debugging, and automated software engineering.",
    "prerequisites": ["COMPSCI 320 (or COMPSCI 220 and COMPSCI 326) with a grade of C or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 532",
    "title": "Systems for Data Science",
    "instructors": ["Peter Klemperer"],
    "description": "In this course, students will learn the fundamentals behind large-scale systems in the context of data science. We will cover the issues involved in scaling up (to many processors) and out (to many nodes) parallelism in order to perform fast analyses on large datasets. These include locality and data representation, concurrency, distributed databases and systems, performance analysis and understanding.",
    "prerequisites": ["COMPSCI 377 and COMPSCI 445 both with a grade of C or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 535",
    "title": "Computer Architecture",
    "instructors": ["Charles Weems"],
    "description": "The structure of digital computers is studied at several levels, from the basic logic level, to the component level, to the system level. Topics include: the design of basic components such as arithmetic units and registers from logic gates; the organization of basic subsystems such as the memory and I/O subsystems; the interplay between hardware and software in a computer system; the von Neumann architecture and its performance enhancements such as cache memory, instruction and data pipelines, coprocessors, and parallelism.",
    "prerequisites": ["COMPSCI 335 with a grade of C or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 546",
    "title": "Applied Information Retrieval",
    "instructors": ["Hamed Zamani"],
    "description": "COMPSCI 546 is a graduate-level course intended to cover information retrieval and other information processing activities from an applied perspective. There will be numerous programming projects and assignments. Topics include search engine construction, learning to rank, classification and clustering, and machine learning models for information retrieval.",
    "prerequisites": ["COMPSCI 320 (or COMPSCI 326) and COMPSCI 383 (or COMPSCI 389 or COMPSCI 446 or COMPSCI 485 or COMPSCI 585) all with a grade of C or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 561",
    "title": "System Defense and Test",
    "instructors": ["Parviz Kermani"],
    "description": "This class trains students to detect and analyze weaknesses and vulnerabilities in target systems as a method of assessing the security of a system. Topics include penetration testing, information gathering, social engineering, malware, denial of service attacks, SQL injection, buffer overflow, session hijacking, and system hacking.",
    "prerequisites": ["COMPSCI 360 (or COMPSCI 460 or COMPSCI 560 or COMPSCI 660 or E&C-ENG 371) and COMPSCI 453 (or E&C-ENG 325), all with a grade of C or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 564",
    "title": "Cyber Effects: Reverse Engineering, Exploit Analysis, and Capability Development",
    "instructors": ["Jeffrey Hamalainen", "Seth Landsman", "Nick Merlino", "Corre Steele", "Edward Walters", "Adam Woodbury"],
    "description": "This course covers a broad range of topics related to cyber security and operations, focusing on real-world studies of reverse engineering, exploit analysis, and capability development. Topics include embedded security, exploit development, and analysis.",
    "prerequisites": ["COMPSCI 230 (or E&C-ENG 322) and COMPSCI 360 (previously COMPSCI 460 or COMPSCI 365 or COMPSCI 390R or COMPSCI 466 or E&C-ENG 371), all with a grade of C or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 565",
    "title": "Advanced Digital Forensic Systems",
    "instructors": ["Peter Klemperer"],
    "description": "This course introduces students to state-of-the-art techniques in developing digital forensic systems. Topics may include advanced file carving, forensic analysis of modern filesystems, network forensics, mobile device forensics, memory forensics, and anti-forensics.",
    "prerequisites": ["COMPSCI 365 or COMPSCI 377 with a grade of C or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 571",
    "title": "Data Visualization and Exploration",
    "instructors": ["Hamza Mohamed Elhamdadi"],
    "description": "This course covers fundamental algorithmic and design principles for visualizing and exploring complex data. Topics include human perception, design theory, clustering, dimensionality reduction, and statistical graphics using Python or JavaScript with D3.",
    "prerequisites": ["COMPSCI 220, or COMPSCI 230, or COMPSCI 326 with a grade of C or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 589",
    "title": "Machine Learning",
    "instructors": ["Bruno Castro da Silva"],
    "description": "This course introduces core machine learning models and algorithms for classification, regression, clustering, and dimensionality reduction. Topics include model selection, regularization, and evaluation, with implementations using Python, Matlab, R, Scala, or Julia.",
    "prerequisites": ["MATH 545 and COMPSCI 240 and STATISTC 315/515 all with a grade of C or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 590AB",
    "title": "Quantum Cryptography",
    "instructors": ["Filip Rozpedek"],
    "description": "This course introduces the world of quantum cryptographic protocols and describes how quantum mechanics enables secure key distribution. Topics include quantum computing, entanglement, and quantum protocols beyond key distribution.",
    "prerequisites": ["MATH 132 and MATH 235 and COMPSCI 240 (or STATISTC 315/515 or PHYSICS 281 or PHYSICS 287) all with a grade of C or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 590AE",
    "title": "Mobile and Wireless Networks",
    "instructors": ["James Kurose"],
    "description": "This course covers wireless networking and mobility principles and practice, with a focus on networking and systems aspects of wireless and mobile networks, including 802.11 (WiFi) and 4G/5G cellular networks.",
    "prerequisites": ["COMPSCI 453 or E&C-ENG 374 with a grade of C or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 590AF",
    "title": "Reverse Engineering and Understanding Exploit Development",
    "instructors": ["Lurene Grenier"],
    "description": "This course covers practical skills in reverse engineering and binary exploitation, including attack patterns, Intel-based assembly, vulnerability analysis, and Linux-focused exploitation.",
    "prerequisites": ["COMPSCI 230 (or E&C-ENG 322) with a grade of C or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 590QC",
    "title": "Quantum Communication",
    "instructors": ["Gayane Vardoyan"],
    "description": "This course introduces principles of quantum communication, including quantum repeaters, entanglement, and noise in quantum systems. Topics include quantum internet and applications.",
    "prerequisites": ["MATH 235 and COMPSCI 240 (or STATISTC 315/515), both with a grade of C or better"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 596C",
    "title": "Independent Study - Complexity Theory",
    "instructors": ["David Barrington"],
    "description": "A group study of 'Computational Complexity: A Modern Approach' by Arora and Barak. Students present material on a rotating basis with no exams. This course does not count toward the CS or INFORM Major.",
    "prerequisites": [],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 603",
    "title": "Robotics",
    "instructors": ["Hao Zhang"],
    "description": "An advanced overview of robotics covering perception, planning, and control. Topics include research discussions on state-of-the-art algorithms with hands-on implementations in simulations.",
    "prerequisites": [],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 611",
    "title": "Advanced Algorithms",
    "instructors": ["Hedyeh Beyhaghi"],
    "description": "Topics include divide-and-conquer algorithms, graph algorithms, matroids, greedy algorithms, randomized algorithms, NP-completeness, approximation algorithms, and linear programming. Open to graduate students only.",
    "prerequisites": ["COMPSCI 311"],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 627",
    "title": "Fixing Social Media",
    "instructors": ["Ethan Zuckerman"],
    "description": "This course explores the problems of current social media models and examines affirmative visions of healthier social media systems. Topics include hyperpolarization, misinformation, and ethical social media models.",
    "prerequisites": [],
    "credits": 3
  },
  {
    "course_code": "COMPSCI 645",
    "title": "Database Design and Implementation",
    "instructor": "Marco Serafini",
    "description": "This course covers the design and implementation of traditional relational database systems as well as advanced data management systems. The course will treat fundamental principles of databases such as the relational model, conceptual design, and schema refinement. We will also cover core database implementation issues including storage and indexing, query processing and optimization, and transaction management. Additionally, we will address challenges in modern information systems, including scalability and parallelization, big data systems, cloud databases, dealing with graph and vector data, and the integration of database management systems and machine learning.",
    "credits": 3
  },
  {
    "course_code": "COMPSCI 651",
    "title": "Optimization in Computer Science",
    "instructor": "Madalina Fiterau Brostean",
    "description": "Much recent work in computer science in a variety of areas, from game theory to machine learning and sensor networks, exploits sophisticated methods of optimization. This course is intended to give students an in-depth background in both the foundations as well as some recent trends in the theory and practice of optimization for computer science. The Optimization course covers these topics, which are critical to a large number of research projects conducted within the department.",
    "credits": 3
  },
  {
    "course_code": "COMPSCI 677",
    "title": "Distributed and Operating Systems",
    "instructor": "Prashant Shenoy",
    "description": "This course provides an in-depth examination of the principles of distributed systems and advanced concepts in operating systems. Covered topics include client-server programming, distributed scheduling, virtualization, cloud computing, distributed storage, security in distributed systems, distributed middleware, ubiquitous computing, and applications such as the Internet of Things, Web and peer-to-peer systems.",
    "credits": 3
  },
  {
    "course_code": "COMPSCI 682",
    "title": "Neural Networks: A Modern Introduction",
    "instructor": "Chuang Gan",
    "description": "This course will focus on modern, practical methods for deep learning with neural networks. The course will cover simple classifiers such as perceptrons and logistic regression classifiers, and move on to standard neural networks, convolutional neural networks, some elements of recurrent neural networks, and transformers. The emphasis will be on understanding the basics and on practical application more than on theory. Many applications will be in computer vision and natural language processing.",
    "credits": 3
  },
  {
    "course_code": "COMPSCI 683",
    "course_name": "Artificial Intelligence",
    "instructors": ["Yair Zick"],
    "description": "In-depth introduction to Artificial Intelligence focusing on techniques that allow intelligent systems to reason effectively with uncertain information and cope with limited computational resources. Topics include: problem-solving using search, heuristic search techniques, constraint satisfaction, local search, abstraction and hierarchical search, resource-bounded search techniques, principles of knowledge representation and reasoning, logical inference, reasoning under uncertainty, belief networks, decision-theoretic reasoning, representing and reasoning about preferences, planning under uncertainty using Markov decision processes, multi-agent systems, and computational models of bounded rationality.",
    "credits": 3
  },
  {
    "course_code": "COMPSCI 685",
    "course_name": "Advanced Natural Language Processing",
    "instructors": ["Haw-Shiuan Chang"],
    "description": "This course will broadly deal with deep learning methods for natural language processing, with a specific focus on large language models. Most of the semester will focus on neural language models. It is intended for graduate students in computer science and linguistics who are (1) interested in learning about cutting-edge research progress in NLP and (2) familiar with machine learning fundamentals. We will cover modeling architectures, training objectives, and downstream tasks (e.g., text classification, question answering, and text generation). Coursework includes programming assignments and a final project.",
    "credits": 3
  },
  {
    "course_code": "COMPSCI 690BB",
    "title": "Quantum Cryptography",
    "instructor": "Filip Rozpedek",
    "description": "The ability to transmit quantum information over long distances...",
    "credits": 3
  },
  {
    "course_code": "COMPSCI 690G",
    "title": "Security for Large-Scale Systems",
    "instructor": "Pubali Datta",
    "description": "This course provides an in-depth examination of the issues in system security, and assumes prior knowledge of operating system concepts. We will start with learning the classic approaches to security attacks and defenses from the perspective of a single host system. Topics include access control, information flow control, system auditing, privilege separation, security policies, host-based intrusion detection etc. Then we will study how these classic mechanisms are expanded and adapted to modern distributed system platforms such as cloud platforms, Internet of Things platforms, and large enterprises.",
    "credits": 3
  },
  {
    "course_code": "COMPSCI 690QC",
    "title": "Quantum Communication",
    "instructor": "Gayane Vardoyan",
    "description": "This course will provide an introduction to fundamental principles...",
    "credits": 3
  },
  {
    "course_code": "COMPSCI 690R",
    "title": "Computing for Digital Biomarkers in Healthcare",
    "instructor": "Sunghoon Lee",
    "description": "Computer science has played a pivotal role in developing innovative technologies to monitor patients' health conditions beyond the traditional laboratory or clinical environments. The development of clinically valid digital biomarkers can enable a wide range of applications, including the implementation of targeted behavioral interventions to drive substantial improvements in health-related outcomes.",
    "credits": 3
  },
  {
    "course_code": "COMPSCI 690U",
    "title": "Computational Biology and Bioinformatics",
    "instructor": "Anna Green",
    "description": "This course is designed to provide computer scientists with a comprehensive introduction...",
    "credits": 3
  },
  {
    "course_code": "COMPSCI 692DQ",
    "title": "Seminar - Topics in Distributed Quantum Computing",
    "instructor": "Donald Towsley, Gayane Vardoyan",
    "description": "This seminar focuses on distributed quantum computing (DQC)...",
    "credits": 3
  },
  {
    "course_code": "COMPSCI 691O",
    "title": "Seminar - Tools for Explanatory and Tutoring Systems",
    "instructor": "Beverly Woolf",
    "description": "Artificial Intelligence will radically change education. Through machine learning, data mining, analytics, robotics, and user models, AI will replace false learning boundaries (e.g., learning places, time, level of study); personalize learning; make learning instantly available to everyone; connect learners with partners; provide multi-media; and augment human learning ability. This seminar examines recent work in explanatory and tutoring systems, presents theories about digital teaching and learning, and describes how to deliver personalized teaching in online systems. Such software supports people working alone or in collaborative inquiry to rapidly access and integrate global information.",
    "credits": 3
  },
  {
    "course_code": "COMPSCI 692EF",
    "title": "Seminar - Embedded Models for IoT and Health",
    "instructor": " Deepak Ganesan, Phuc Nguyen",
    "description": "The deployment of foundation models in resource-constrained mobile and wearable devices presents unique challenges and opportunities, particularly in health and wearable sensing applications. This advanced seminar explores the cutting-edge intersection of large AI models, embedded systems, and digital health, with a focus on real-world applications in wearable and mobile biosignal sensing platforms. The course examines two primary themes: (1) the application of foundation models in multimodal biosignal sensing contexts, including real-time physiological monitoring, neural signal processing, behavioral understanding, and clinical decision support through wearable devices such as EEG headsets, smartwatches, smart rings, eyewear, and earables; and (2) the technical challenges and solutions for deploying these powerful models on resource-constrained devices, including model compression, efficient inference, on-device learning, and real-time processing requirements. Example topics will include: Application Domains in Health and Wearables, Systems Optimizations and Architecture, IoT Applications and Environments. The course will primarily consist of paper readings, presentations, and discussions. Students will critically examine recent advances in the field through both academic papers and industry developments. For 3-credit option, a semester-long research project is required, involving either the development of a novel application using foundation models on wearable platforms or the implementation of optimization techniques for embedded deployment. ",
    "credits": 1
  },
  {
    "course_code": "COMPSCI 692L",
    "title": "Seminar - Natural Language Processing",
    "instructor": "Brendan O'Connor",
    "description": "Weekly seminar requiring students to read an NLP paper and discuss and review it from a variety of perspectives. Some weeks will feature invited speakers instead of paper reviews.",
    "credits": 1
  },
  {
    "course_code": "COMPSCI 692PA",
    "title": "Seminar - Advanced Topics on Privacy and Security for Generative Models",
    "instructor": "Eugene Bagdasarian",
    "description": "New capabilities of language and diffusion models enable applications that interact with users across different modalities, perform independent actions, and leverage external tools. In the seminar, we will study how these capabilities create new privacy and security challenges by analyzing recent papers in ML and S&P communities and connecting discovered problems to fundamental issues from previous decades. As part of the course, there will be an opportunity to conduct a research project that goes deeper into these problems.",
    "credits": 1
  },
  {
    "course_code": "COMPSCI 696DS",
    "title": "Independent Study - Data Science",
    "instructor": "Andrew McCallum",
    "description": "The goal of this course is to provide Professional Masters students with industry mentorship and real-world data science training. Beyond-classroom educational opportunities are an excellent way to gain practical experience on a substantial project, to learn advanced skills, to collaborate with a professional PhD researcher, to form a connection to a data science company, and to work in a team with other graduate students. Students form three-to-five-person teams, each of which work on one project throughout the semester, under the guidance of their industry mentor, additional PhD student mentors, and the course faculty instructor.",
    "credits": 3
  },
  {
    "course_code": "COMPSCI 701",
    "title": "Advanced Topics in Computer Science",
    "description": "Advanced Topics in Computer Science Master's Project: Advanced research project in Computer Science. The 3 credit option is for the second semester of a two-semester sequence, 701 followed by 701Y. The 6 credit option is for a project that will be completed over two semesters with enrollment in only one semester.",
    "credits": "3 or 6"
  },
  {
    "course_code": "COMPSCI 701Y",
    "title": "Advanced Topics in Computer Science (1st Semester)",
    "description": "Advanced Topics in Computer Science Master's Project: Advanced research project in Computer Science. Indicates the first semester of a two-semester sequence, 701Y (3 credits) followed by 701 (3 credits), with grade for both assigned at the end.",
    "credits": 3
  },
  {
    "course_code": "COMPSCI 879",
    "title": "Teaching Assistants as Tomorrow's Faculty",
    "instructor": "Ivon Arroyo",
    "description": "Teaching Assistants as Tomorrow's Faculty prepares Teaching Assistants (TAs) at the College of Information and Computer Sciences to fulfill their duties in an effective and pedagogically sound manner. The two-credit (not repeatable) course is semester long and taken by all TAs prior to assuming assistantship.",
    "credits": 2
  }
]