[
  {
    "code": "CICS 109",
    "title": "Introduction to Data Analysis in R",
    "instructors": "Jasper McChesney",
    "description": "An introduction to data analysis in the open-source R language, with an emphasis on practical data work. Topics will include data wrangling, summary statistics, modeling, and visualization. Will also cover fundamental programming concepts including data types, functions, flow of control, and good programming practices. Intended for a broad range of students outside of computer science. Some familiarity with statistics is expected. 1 credit.",
    "prerequisites": "N/A",
    "credits": "1"
  },
  {
    "code": "CICS 110",
    "title": "Foundations of Programming",
    "instructors": "Cole Reilly, Jacob Urisman, Brett Mullins, Prit Pritam Shah, Aadam Anish Lokhandwala",
    "description": "An introduction to computer programming and problem solving using computers. This course teaches you how real-world problems can be solved computationally using programming constructs and data abstractions of a modern programming language. Concepts and techniques covered include variables, expressions, data types, objects, branching, iteration, functions, classes, and methods. We will also cover how to translate problems into a sequence of instructions, investigate the fundamental operation of a computational system and trace program execution and memory, and learn how to test and debug programs. No previous programming experience required. (Gen. Ed. R2) Prerequisite: R1 (or a score of 15 or higher on the math placement test Part A), or one of the following courses: MATH 101&102 or MATH 104 or MATH 127 or MATH 128 or MATH 131 or MATH 132. 4 credits.",
    "prerequisites": "R1 (or a score of 15 or higher on the math placement test Part A), or one of the following courses: MATH 101&102 or MATH 104 or MATH 127 or MATH 128 or MATH 131 or MATH 132",
    "credits": "4"
  },
  {
    "code": "CICS 127",
    "title": "Introduction to Public Interest Technology",
    "instructors": "Francine Berman",
    "description": "Today's world is complex and tech driven. How do we use the tools of information technology to solve problems in a socially responsible way, i.e., in a way that both empowers us and promotes the well-being of the communities in which we live? In this course, we describe the socio-technical world and pragmatic strategies for promoting personal and social responsibility. We explore the questions: What is the public interest in a socio-technical world? What strategies can we use to promote social responsibility in the public sector, private sector, and general public? What can each of us do to make the world a better place? This course is for everyone at all levels and with all interests. No programming or prerequisites are required. We focus on building skills to think analytically, broadly, and strategically, as well as to communicate effectively about complex problems with societal impact. Assignments will provide students multiple paths to success. Counts towards the IT minor and is required for the PIT Undergraduate Certificate. (Gen. Ed. SI) 4 credits.",
    "prerequisites": "N/A",
    "credits": "4"
  },
  {
    "code": "CICS 160",
    "title": "Object-Oriented Programming",
    "instructors": "Jaime Davila, Cole Reilly",
    "description": "This course will expose students to programming practices beyond the introductory level, concentrating on Object Oriented Programming techniques and an introduction to Data Structures. Students will also study and analyze the complexity of both the algorithms presented in class and of the algorithms they develop. This course also provides experience with the development and analysis of recursive algorithms and programs. Before taking this course, students are expected to have been exposed to the following concepts through a college-level course or equivalent in some high level computer programming language: input and output operations, conditional statements, loops, arrays, recursion, and functions/methods. The course places an emphasis on the careful design and testing of programs. (Gen. Ed. R2) Prerequisite: CICS 110 (previously INFO 190S) or COMPSCI 121 with a grade of C or better. 4 credits.",
    "prerequisites": "CICS 110 (previously INFO 190S) or COMPSCI 121 with a grade of C or better",
    "credits": "4"
  },
  {
    "code": "CICS 210",
    "title": "Data Structures",
    "instructors": "Mordecai Golin, Timothy Richards",
    "description": "An introduction to the design, analysis, and implementation of data structures. This course teaches you how to build, test, debug, document, and evaluate objects that encapsulate data and their associated operations using programming constructs and data abstractions of a modern programming language. Concepts and techniques covered include linear and non-linear structures, recursive structures and algorithms, traversal algorithms, binary search trees, balanced trees, priority queues, union-find, hash tables, bloom filters, and graphs. We will also informally compare and contrast the run time efficiency of algorithms and their performance characteristics including the concept of worst-case running time analysis and the classification of algorithms in terms of constant, logarithmic, linear, log linear, quadratic, and exponential time using Big-O notation. (Gen. Ed. R2) Prerequisite: CICS 160 (previously INFO 190T) with a grade of C or better. 4 credits.",
    "prerequisites": "CICS 160 (previously INFO 190T) with a grade of C or better",
    "credits": "4"
  },
  {
    "code": "CICS 256",
    "title": "Make: A Hands-on Introduction to Physical Computing",
    "instructors": "Stefan Krastanov",
    "description": "Inspired by the Maker movement, this course provides a hands-on introduction to physical computing: sensing and responding to the physical world using computers. Specific topics include: basic electronics and circuit design, microcontroller programming using Arduinos, sensing and responding to the physical world, rapid prototyping (3D printing and laser cutting etc.), soft circuits and wearable electronics. The course will encourage and empower students to invent, design, and build practical hardware projects that interact with the physical world. This course has a required lab section, and counts as one of the CS Lab Science Requirement courses for the BS-CS. Prerequisite: CICS 210 (or COMPSCI 187) with a grade of C or better and completion of the R1 (Basic Math Skills) Gen. Ed. 4 credits.",
    "prerequisites": "CICS 210 (or COMPSCI 187) with a grade of C or better and completion of the R1 (Basic Math Skills) Gen",
    "credits": "4"
  },
  {
    "code": "CICS 291C",
    "title": "Seminar - Finding your Strengths and Designing your Career",
    "instructors": "Casey Maloney",
    "description": "This course is designed to prepare CICS students for their internship and job searches, improve their professional skills (both technical and soft) and help them approach professional development and/or advanced educational opportunities with confidence. 1 credit.",
    "prerequisites": "N/A",
    "credits": "1"
  },
  {
    "code": "CICS 291S",
    "title": "Seminar - CICS Second Year Pathways",
    "instructors": "Erfan Entezami",
    "description": "This seminar will give students the opportunity to learn more about the different areas and career pathways in computer science, through guest lectures by professors and grad students, reading research papers, and coordination with CICS Careers. It is intended to be taken alongside any COMPSCI 200-level core course. Prerequisite: CICS 210 (or COMPSCI 187) with a grade of C or better. 1 credit.",
    "prerequisites": "CICS 210 (or COMPSCI 187) with a grade of C or better",
    "credits": "1"
  },
  {
    "code": "CICS 291T",
    "title": "Seminar - CICS Transfer Success",
    "instructors": "Emma Anderson",
    "description": "This seminar is intended to help you become fully prepared to succeed in CICS at UMass. Students in this seminar will be led by an instructor with a detailed understanding of the transfer student experience, and supported by various staff members in CICS. You will learn about which campus and College resources will be most helpful to you, how to best utilize these resources, and where you can look for other opportunities to connect. 1 credit.",
    "prerequisites": "N/A",
    "credits": "1"
  },
  {
    "code": "CICS 298A",
    "title": "Practicum - Leadership: Communicating Across Expertise",
    "instructors": "Emma Anderson, Ruchi Gupta",
    "description": "No matter where you end up in tech, you will need to explain concepts, products and ideas to people with different technical backgrounds. This course is intended to help prepare you for these communication tasks. Through the lens of tutoring, we will work on explaining technical ideas clearly and compassionately to others. We will do some theoretical study, including a history of CS education as well asbrain and learning science, and some practice, including tutoring beginning students in CS. This course is intended for a broad range of students looking to pursue careers in tech, but will be particularly useful for those who are currently UCAs or intending to apply for UCA positions in the future. Prerequisite: a grade of C or better in CICS 160, COMPSCI 186, COMPSCI 187, or CICS 210. 1 credit.",
    "prerequisites": "a grade of C or better in CICS 160, COMPSCI 186, COMPSCI 187, or CICS 210",
    "credits": "1"
  },
  {
    "code": "CICS 305",
    "title": "Social Issues in Computing",
    "instructors": "Erin Butler, Elizabeth Gunther, Siobhan Meï, Justin Obara, Matthew Ross, Christina Sutcliffe",
    "description": "Through a careful analysis and discussion of a range of computing issues, topics, and polices, we will explore various impacts of computers on modern society. This class satisfies the Junior Year Writing requirement by providing directed practice and specific instruction in a range of writing genres. Students will produce approximately 20-25 pages of polished written work over the course of the semester. CICS Primary Majors only. Prerequisite: CS Majors: ENGLWRIT 112 with a grade of C or better (or English Writing waiver), COMPSCI 220, COMPSCI 230 and COMPSCI 240 (or 250); INFORM Majors: ENGLWRIT 112 with a grade of C or better (or English Writing waiver) and INFO 248. 3 credits.",
    "prerequisites": "CS Majors: ENGLWRIT 112 with a grade of C or better (or English Writing waiver), COMPSCI 220, COMPSCI 230 and COMPSCI 240 (or 250); INFORM Majors: ENGLWRIT 112 with a grade of C or better (or English Writing waiver) and INFO 248",
    "credits": "3"
  },
  {
    "code": "CICS 396A",
    "title": "Independent Study - Directed Research Group",
    "instructors": "Neena Thota",
    "description": "This course is part of the CICS Early Research Scholars Program (ERSP). It provides a group-based, dual-mentored research structure designed to be supportive and inclusive first research experience for a large number of early-career Computer Science and Informatics majors. Students can apply and be accepted to the program at the end of their first year (spring term). After successfully completing the Introduction to Research in the Discipline course in the fall, they are then enrolled in this course in the spring of the second year. This course may count as a major elective for CS and INFORM majors with UPD approval, subject to program rules that apply to independent study courses. 3 credits.",
    "prerequisites": "N/A",
    "credits": "3"
  },
  {
    "code": "CICS 590P",
    "title": "Technology Policy and Innovation to Serve the Common Good",
    "instructors": "Emily Nutwell, Carolina Rossini",
    "description": "In this course, we will introduce Public Interest Technology, innovation, and relevant regulatory frameworks to provide a foundation to explore the thoughtful design of technology that can serve society while remaining safe for all users and stakeholders. The course begins with examining the core values of public interest technology, such as fairness, transparency, accountability, and inclusivity. We will then review foundational concepts around innovation and strategies, along with an overview of technology governance. An overview of product development models, focusing on Agile product development will be presented along with a presentation of tech governance within an Agile framework. We will then analyze case studies where technologies have either succeeded or failed to uphold these values, examining the societal impact of emerging technologies like artificial intelligence (AI), self-driving cars, digital platforms, and data-driven systems. Throughout the semester, guest lectures from leaders in the fields of technology policy, innovation, and governance will offer insights into how you can bridge the gap between regulatory goals and technological creativity in your future careers. This course counts as an Elective for the CS and INFORM Majors. Cross-listed with SPP 590P. Undergraduate Prerequisite: CICS 305 with a grade of C or better. 3 credits.",
    "prerequisites": "CICS 305 with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 119",
    "title": "Introduction to Programming",
    "instructors": "Devdhar Patel",
    "description": "A complete introduction to computer programming using the Python language. Topics include coverage of all the supported data types and program code structures, functions (up through lambda expressions and recursion), reasoning about and debugging existing code, implementation of custom libraries, selection of data structures, and the fundamentals of object-oriented programming. Students will create, debug, and run Python 3 programs that explore each of these topics in turn, from simple loops up through the processing of large data sets, and eventually to the creation of professional-quality libraries to synthesize graphics images and audio files. No prior programming experience expected. Not open to Computer Science majors. 3 credits.",
    "prerequisites": "N/A",
    "credits": "3"
  },
  {
    "code": "COMPSCI 198C",
    "title": "Practicum - Introduction to the C Programming Language",
    "instructors": "Meng-Chieh Chiu, Timothy Richards",
    "description": "This practicum assumes general background and experience in computer programming (such as that provided by COMPSCI 121 or a similar introductory programming course) and some knowledge of data structures. Content will include basic C data types, declarations, expressions, statements, and functions; simple use of macros; some common library calls (such as formatted input/output); basic pointer manipulation using linked lists; and introduction to using standard tools (gcc and make). A required prerequisite for COMPSCI 230, effective Fall 2023. Prerequisite: CICS 160 (previously INFO 190T or COMPSCI 186 or CICS 210) with a grade of C or better, or COMPSCI 121 with a grade of B or better. 1 credit.",
    "prerequisites": "CICS 160 (previously INFO 190T or COMPSCI 186 or CICS 210) with a grade of C or better, or COMPSCI 121 with a grade of B or better",
    "credits": "1"
  },
  {
    "code": "COMPSCI 220",
    "title": "Programming Methodology",
    "instructors": "Marius Minea",
    "description": "Development of individual skills necessary for designing, implementing, testing and modifying larger programs, including: design strategies and patterns, using functional and object-oriented approaches, testing and program verification, code refactoring, interfacing with libraries. There will be significant programming and mid-term and final examinations. Prerequisite: CICS 210 (or COMPSCI 187) with a grade of C or better. 4 credits.",
    "prerequisites": "CICS 210 (or COMPSCI 187) with a grade of C or better",
    "credits": "4"
  },
  {
    "code": "COMPSCI 230",
    "title": "Computer Systems Principles",
    "instructors": "Phuthipong Bovornkeeratiroj, Meng-Chieh Chiu",
    "description": "Large-scale software systems like Google - deployed over a world-wide network of hundreds of thousands of computers - have become a part of our lives. These are systems success stories - they are reliable, available (\"up\" nearly all the time), handle an unbelievable amount of load from users around the world, yet provide virtually instantaneous results. On the other hand, many computer systems don't perform nearly as well as Google - hence the now-clich \"the system is down.\" In this class, we study the scientific principles behind the construction of high-performance, scalable systems. The course begins with a discussion of C data representation, and moves up the stack from there to the features of modern architectures, assembly languages, and operating system services such as I/O, process, and synchronization. This class assumes students have either taken COMPSCI 198C or have equivalent experience in the C programming language. Prerequisite: CICS 210 (or COMPSCI 187) with a grade of C or better and COMPSCI 198C. 4 credits.",
    "prerequisites": "CICS 210 (or COMPSCI 187) with a grade of C or better and COMPSCI 198C",
    "credits": "4"
  },
  {
    "code": "COMPSCI 240",
    "title": "Reasoning Under Uncertainty",
    "instructors": "Mark Wilson",
    "description": "Development of mathematical reasoning skills for problems that involve uncertainty. Each concept will be illustrated by real-world examples and demonstrated through in-class and homework exercises. Counting and probability -- basic counting problems, probability definitions, mean, variance, binomial distribution, discrete random variables, continuous random variables, Markov and Chebyshev bounds, Laws of large numbers, and central limit theorem. Probabilistic reasoning -- conditional probability and odds, Bayes' Law, Markov Chains, Bayesian Networks. Statistical topics such as estimation of parameters and linear regression, as time permits. Prerequisite: CICS 160 (previously INFO 190T or COMPSCI 187) or CICS 210 and MATH 132, all with a grade of C or better. 4 credits.",
    "prerequisites": "CICS 160 (previously INFO 190T or COMPSCI 187) or CICS 210 and MATH 132, all with a grade of C or better",
    "credits": "4"
  },
  {
    "code": "COMPSCI 250",
    "title": "Introduction to Computation",
    "instructors": "David Barrington, Mordecai Golin",
    "description": "Basic concepts of discrete mathematics useful to computer science: set theory, strings and formal languages, propositional and predicate calculus, relations and functions, basic number theory. Induction and recursion: interplay of inductive definition, inductive proof, and recursive algorithms. Graphs, trees, and search. Finite-state machines, regular languages, nondeterministic finite automata, Kleene's Theorem. Problem sets, 2 midterm exams, timed final. Prerequisite: CICS 160 (previously INFO 190T or COMPSCI 187 or E&C-ENG 241, or CICS 210) and MATH 132, all with a grade of C or better. 4 credits.",
    "prerequisites": "CICS 160 (previously INFO 190T or COMPSCI 187 or E&C-ENG 241, or CICS 210) and MATH 132, all with a grade of C or better",
    "credits": "4"
  },
  {
    "code": "COMPSCI 311",
    "title": "Introduction to Algorithms",
    "instructors": "Marius Minea, Daniel Sheldon",
    "description": "This course will introduce you to a variety of techniques to design algorithms, such as divide and conquer, greedy, dynamic programming, and network flow. You will learn to study the performance of various algorithms within a formal, mathematical framework. You will also learn how to design very efficient algorithms for many kinds of problems and recognize problems that currently do not have efficient algorithms. Assignments may include programming: you should be able to program in Java, C, or some other closely related language. Mathematical experience (as provided by COMPSCI 250) is required. This course is required for the CS Major (BS) and counts as a CS Elective for the CS Major (BA). Prerequisite: CICS 210 (OR COMPSCI 187) , and either COMPSCI 250 or MATH 455, all with a grade of C or better. 4 credits.",
    "prerequisites": "CICS 210 (OR COMPSCI 187) , and either COMPSCI 250 or MATH 455, all with a grade of C or better",
    "credits": "4"
  },
  {
    "code": "COMPSCI 320",
    "title": "Introduction to Software Engineering",
    "instructors": "Gordon Anderson, Jaime Davila, Matthew Rattigan",
    "description": "In this course, students learn and gain practical experience with software engineering principles and techniques. The practical experience centers on a semester-long team project in which a software development project is carried through all the stages of the software life cycle. Topics in this course include requirements analysis, specification, design, abstraction, programming style, testing, maintenance, communication, teamwork, and software project management. Particular emphasis is placed on communication and negotiation skills and on designing and developing maintainable software. Use of computer required. Several written assignments, in-class presentations, and a term project. This course satisfies the IE Requirement and counts as a CS Elective for the CS Major. Prerequisite: COMPSCI 220 with a grade of C or better. 4 credits.",
    "prerequisites": "COMPSCI 220 with a grade of C or better",
    "credits": "4"
  },
  {
    "code": "COMPSCI 326",
    "title": "Web Programming",
    "instructors": "Meng-Chieh Chiu",
    "description": "The web is arguably today's most important application platform. Web browsers run on practically every device, and even many phone applications are in fact web applications under the covers. This course will cover a broad range of client-side web technologies, including HTTP itself, HTML5, CSS, and JavaScript; it will additionally cover key concepts for the server side of web applications, including key value stores and SQL servers. This course will also cover key concepts and technologies including AJAX, JavaScript libraries (e.g., jQuery), and web security. This course is hands-on and heavily project-based; students will construct a substantial dynamic web application based on the concepts, technologies, and techniques presented during lectures and in readings. This course satisfies the IE Requirement and an Elective for both the CS and INFORM Majors. Note: as the name web programming denotes, programming is a key component of this class. Previous background in JavaScript is strongly recommended. Prerequisite: COMPSCI 220 (or COMPSCI 230) with a grade of C or better. 4 credits.",
    "prerequisites": "COMPSCI 220 (or COMPSCI 230) with a grade of C or better",
    "credits": "4"
  },
  {
    "code": "COMPSCI 328",
    "title": "Mobile Health Sensing and Analytics",
    "instructors": "Phuc Nguyen",
    "description": "The typical smartphone comes equipped with a plethora of sensors for monitoring activity, speech patterns, social interactions, and location. In addition, mobile accessories such as wearable wristbands now enable routine and continuous monitoring of a host of physiological signals (e.g., heart rate, respiratory rate, oxygen saturation, and others.). In conjunction, these sensors can enable higher-order inferences about more complex human activities/behavioral states (e.g., activity patterns, stress, sleep, social interactions, etc.). Such ubiquitous sensing in daily life, referred to as mobile health sensing, promises to revolutionize our understanding of human activities and health conditions. This course is a hands-on introduction to personal health sensing through mobile phones. Please note that this is a *programming-heavy* class so a solid programming background is required. All programming assignments are in Python, so programming experience with *Python* is recommended. This course counts as an Elective for the CS Major. Prerequisite: CS MAJORS: CICS 210 (or COMPSCI 187) with a grade of C or better; INFORM MAJORS: INFO 248 and CICS 160 (previously INFO 190T or COMPSCI 186 or COMPSCI 187), all with a grade of C or better 3 credits.",
    "prerequisites": "CS MAJORS: CICS 210 (or COMPSCI 187) with a grade of C or better; INFORM MAJORS: INFO 248 and CICS 160 (previously INFO 190T or COMPSCI 186 or COMPSCI 187), all with a grade of C or better 3 credits",
    "credits": "3"
  },
  {
    "code": "COMPSCI 345",
    "title": "Practice and Applications of Data Management",
    "instructors": "Gordon Anderson",
    "description": "Computing has become data-driven, and databases are now at the heart of commercial applications. The purpose of this course is to provide a comprehensive introduction to the use of data management systems within the context of various applications. The emphasis is on relational databases, though non-relational databases are also introduced. Some of the covered topics include the relational data model, data retrieval, application-driven database design, schema refinement, implementation of basic transactions, database security. This course counts as a CS Elective for the CS Major. Students who have completed COMPSCI 445 are not eligible to take this course without instructor permission. Prerequisite: CS MAJORS: CICS 210 (or COMPSCI 187) with a grade of C or better. INFORM MAJORS: INFO 248 and CICS 160 (previously INFO 190T or COMPSCI 186 or COMPSCI 187), all with a grade of C or better. 3 credits.",
    "prerequisites": "CS MAJORS: CICS 210 (or COMPSCI 187) with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 348",
    "title": "Principles of Data Science",
    "instructors": "David Jensen",
    "description": "Data science uses various concepts, practices, algorithms, and systems to extract knowledge and insights from data. It encompasses techniques from machine learning, statistics, databases, visualization, and several other fields. When properly integrated, these techniques can help human analysts make sense of vast stores of digital information. This course presents the fundamental principles of data science, familiarizes students with the technical details of representative algorithms, and connects these concepts to applications in industry, science, and government, including fraud detection, marketing, scientific discovery, and web mining. The course assumes that students are familiar with basic concepts and algorithms from probability and statistics. This course counts as a CS Elective toward the CS Major. Prerequisites: CICS 210 (or COMPSCI 187), COMPSCI 240, and COMPSCI 250 (or MATH 455). 3 credits.",
    "prerequisites": "CICS 210 (or COMPSCI 187), COMPSCI 240, and COMPSCI 250 (or MATH 455)",
    "credits": "3"
  },
  {
    "code": "COMPSCI 360",
    "title": "Introduction to Computer and Network Security",
    "instructors": "Eugene Bagdasarian",
    "description": "This course provides an introduction to the principles and practice of computer and network security. A focus on both fundamentals and practical information will be stressed. The three key topics of this course are cryptography, privacy, and network security. Subtopics include ciphers, hashes, key exchange, security services (integrity, availability, confidentiality, etc.), security attacks, vulnerabilities, anonymous communications, and countermeasures. This course counts as a CS Elective for the CS Major. Prerequisite: COMPSCI 230 with a grade of C or better. 3 credits.",
    "prerequisites": "COMPSCI 230 with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 367",
    "title": "Reverse Engineering and Understanding Exploit Development",
    "instructors": "Lurene Grenier",
    "description": "Many software developers aren't aware of how to properly write secure code. This course covers practical skills in reverse engineering and binary exploitation, and examines the techniques used by hackers in recent major security incidents. The course objective is to provide students with a strong understanding of attack patterns, and to ensure students implement more secure coding practices in their own code. This course begins with an introduction to Intel-based assembly, reverse engineering, vulnerability analysis, and various forms of Linux-focused binary exploitation. The course then covers stack, heap and Linux kernel-based exploitation, and dive into common defensive mitigations such as ASLR, NX and Stack Cookies alongside techniques to bypass each of them. This course is focused on low-level software written in C. COMPSCI 230 is sufficient for demonstrating knowledge of C and that the student has been introduced to assembly. Students who have taken 198C (or can demonstrate a proficiency in C) and can demonstrate a familiarity with assembly can request an override from the instructor. This course counts as a CS Elective for the CS Major, but does not count as an INFORM Elective. Prerequisite: COMPSCI 230 (or E&C-ENG 322 or E&C-ENG 373) with a grade of C or better, or permission of instructor. 3 credits.",
    "prerequisites": "COMPSCI 230 (or E&C-ENG 322 or E&C-ENG 373) with a grade of C or better, or permission of instructor",
    "credits": "3"
  },
  {
    "code": "COMPSCI 370",
    "title": "Introduction to Computer Vision",
    "instructors": "Subhransu Maji",
    "description": "This introductory computer vision class will address fundamental questions about getting computers to \"see\" like humans. We investigate questions such as -What is the role of vision in intelligence? -How are images represented in a computer? -How can we write algorithms to recognize an object? -How can humans and computers \"learn to see better\" from experience? We will write a number of basic computer programs to do things like recognize handwritten characters, track objects in video, and understand the structure of images. This course counts as a CS Elective for the CS Major. Prerequisite: COMPSCI 240 or 383 with a grade of C or better. 3 credits.",
    "prerequisites": "COMPSCI 240 or 383 with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 373",
    "title": "Introduction to Computer Graphics",
    "instructors": "Rui Wang",
    "description": "This course introduces the fundamental concepts of 2D and 3D computer graphics. It covers the basic methods for modeling, rendering, and imaging. Topics include: image processing, 2D/3D modeling, 3D graphics pipeline, WebGL, shading, texture mapping, ray tracing, 3D printing. Throughout the class, we will teach students to learn modern graphics techniques, to model the visual world algorithmically, and to implement algorithms using JavaScript. Students who have taken COMPSCI 473 are not eligible to take this course. Students cannot take COMPSCI 497C after taking this course. This course counts as a CS Elective for the CS Major. Prerequisite: CICS 210 (or COMPSCI 187) and MATH 235 (or INFO 150 or COMPSCI 240) with a grade of C or better. 3 credits.",
    "prerequisites": "CICS 210 (or COMPSCI 187) and MATH 235 (or INFO 150 or COMPSCI 240) with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 377",
    "title": "Operating Systems",
    "instructors": "Phuthipong Bovornkeeratiroj",
    "description": "In this course we examine the important problems in operating system design and implementation. The operating system provides a well-known, convenient, and efficient interface between user programs and the bare hardware of the computer on which they run. The operating system is responsible for allowing resources (e.g., disks, networks, and processors) to be shared, providing common services needed by many different programs (e.g., file service, the ability to start or stop processes, and access to the printer), and protecting individual programs from one another. The course will start with a brief historical perspective of the evolution of operating systems over the last fifty years, and then cover the major components of most operating systems. This discussion will cover the tradeoffs that can be made between performance and functionality during the design and implementation of an operating system. Particular emphasis will be given to three major OS subsystems: process management (processes, threads, CPU scheduling, synchronization, and deadlock), memory management (segmentation, paging, swapping), file systems, and operating system support for distributed systems. Programming projects in C. This course counts as a CS Elective for the CS Major. Prerequisite: COMPSCI 230 with a grade of C or better. 4 credits.",
    "prerequisites": "COMPSCI 230 with a grade of C or better",
    "credits": "4"
  },
  {
    "code": "COMPSCI 383",
    "title": "Artificial Intelligence",
    "instructors": "William McNichols",
    "description": "This course aims to give students a high level understanding of the prominent AI topics that are being employed in industry today. It will provide an introduction to each topic, an overview of its supporting algorithms, and examples of products powered by the technology. Particular emphasis will be had on Machine Learning and developing hands-on practical skills with this technology. Upon completion of this course, students will obtain a wider scope of understanding about modern AI trends in software technology and develop an intuition for how this software works. To succeedin this course, students will need a fundamental understanding of data structures and programming fundamentals. Graph and tree data structures will be used in particular. Programming assignments in this class will be done using Python. Experience in at least one programming language is required and it s strongly recommended you have some Python experience before starting. A mathematical foundation in statistics and linear algebra is not strictly necessary but will deepen understanding of course material. This course counts as an Elective for CS and INFORM Majors. Prerequisite: CS MAJORS: CICS 210 and COMPSCI 240 (or STATISTC 315, previously STATISTC 515), all with a grade of C or better; INFORM MAJORS: INFO 348 and STATISTC 315 (previously STATISTC 515), all with a grade of C or better. 3 credits.",
    "prerequisites": "CS MAJORS: CICS 210 and COMPSCI 240 (or STATISTC 315, previously STATISTC 515), all with a grade of C or better; INFORM MAJORS: INFO 348 and STATISTC 315 (previously STATISTC 515), all with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 389",
    "title": "Introduction to Machine Learning",
    "instructors": "Philip Thomas",
    "description": "The course provides an introduction to machine learning algorithms and applications, and is intended for students with no prior experience with machine learning. Students with prior experience in machine learning or who are already passionate about the subject are encouraged to take COMPSCI 589 instead. Machine learning algorithms answer the question: \"How can a computer improve its performance based on data and from its own experience?\" The course is roughly divided into thirds: supervised learning (learning from labeled data), reinforcement learning (learning via trial and error), and real-world considerations like ethics, safety, and fairness. Specific topics include linear and non-linear regression, (stochastic) gradient descent, neural networks, backpropagation, classification, Markov decision processes, state-value and action-value functions, temporal difference learning, actor-critic algorithms, the reward prediction error hypothesis for dopamine, connectionism for philosophy of mind, and ethics, safety, and fairness considerations when applying machine learning to real-world problems. This course counts as an Elective for the CS and INFORM Majors. Prerequisite: COMPSCI 220 (or COMPSCI 230), COMPSCI 240 (or STATISTC 315/515), and MATH 233, all with a grade of C or better. 3 credits.",
    "prerequisites": "COMPSCI 220 (or COMPSCI 230), COMPSCI 240 (or STATISTC 315/515), and MATH 233, all with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 390B",
    "title": "Harnessing Data Science for Societal Good",
    "instructors": "Abhidip Bhattacharyya",
    "description": "This is a project-based course in which students will explore using large-scale datasets and data analysis to address real-world societal problems in domains such as sustainability, health, and work with different techniques of data analysis and processing. Students will address problems of societal or industrial relevance. Each semester, the course will offer one or more real-world datasets and a selection of sample problems and students will define a project based on these datasets to address a real-word problem in a group setting. Students will collaborate in groups for their project. Students will explore modern data processing tools and software systems to build data processing pipelines for their chosen project. Throughout the course, students will be expected to present their project ideas, develop project proposals outlining their implementation plans, and conclude with a final presentation and report submission. This course provides students with the opportunity to integrate their analytical and collaborative skills for real-world problem-solving. This course counts as an Elective for the CS and INFORM Majors. Prerequisite: COMPSCI 230 and COMPSCI 240 (or STATISTC 315/515), all with a grade of C or better. 3 credits.",
    "prerequisites": "COMPSCI 230 and COMPSCI 240 (or STATISTC 315/515), all with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 403",
    "title": "Introduction to Robotics: Perception, Mechanics, Dynamics, and Control",
    "instructors": "Donghyun Kim",
    "description": "This course covers the concepts and methods needed to understand how to move robots and make them interact with the physical world. We will study theoretical backgrounds and techniques to describe the configuration and state of a robot and to control its motion. The topics that will be covered in the lectures include the representation of three-dimensional movement, mechanisms (kinematics and dynamics), actuators, and dynamics-based feedback control. Students will also learn to use Google Colab and Python programming to build simulation and analysis tools. This course counts as a CS Elective for the CS Major. Prerequisite: MATH 235 and COMPSCI 220 (or COMPSCI 230) all with a grade of C or better. 3 credits.",
    "prerequisites": "MATH 235 and COMPSCI 220 (or COMPSCI 230) all with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 420",
    "title": "Software Entrepreneurship",
    "instructors": "Matthew Rattigan",
    "description": "This course is geared towards students interested in developing software that moves from early stage proof-of-concept ideas towards marketable products with societal benefit. The course leverages the expertise of the Entrepreneurs in Residence (EIR) of the Ventures @ CICS initiative at CICS. The course is grounded in Challenge Based Learning (CBL), an active, student-directed instructional framework that was developed by Apple Inc. and educators. This course counts as a Elective for the CS and INFORM Majors. Prerequisite: COMPSCi 320 (or COMPSCI 326) with a grade of C or better. 3 credits.",
    "prerequisites": "COMPSCi 320 (or COMPSCI 326) with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 426",
    "title": "Scalable Web Systems",
    "instructors": "Timothy Richards",
    "description": "The web has become a large and complex area for application development. Access to an abundance of open source languages, libraries, and frameworks has led to the quick and easy construction of a variety of applications with several moving parts working in coordination to present to the user the illusion of a single program. In reality, web applications are extremely difficult to get right. They involve a large collection of coordinated services, multiple databases, complicated user interfaces, security and performance issues, and ever changing 3rd party services, spread across physical and virtual machines. These complications are further stressed by the large number of concurrent users that access these applications every second. This course will investigate several well known web-based applications and the technology and software architecture used to scale these applications. We will also study a specific topic related to scalability in software design in the context of web application architecture. This course counts as an Elective for the CS and INFORM Majors. Prerequisite: COMPSCI 320 or COMPSCI 326 with a grade of C or better. 3 credits.",
    "prerequisites": "COMPSCI 320 or COMPSCI 326 with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 429",
    "title": "Software Engineering Project Management",
    "instructors": "Gordon Anderson, Jaime Davila, Matthew Rattigan",
    "description": "The purpose of this course is to provide students with practical experience in the management of software development projects. Students in this course will gain this experience by serving as software development team technical managers for teams of software engineering students in COMPSCI 320. As project managers, the students in COMPSCI 429 will be responsible for: supervising and managing the work of teams of COMPSCI 320 students; interfacing with the other COMPSCI 429 students managing other teams in the course; interfacing with the course instructor, course TA, and course customer. COMPSCI 429 students will be assigned readings in software engineering project management to provide a theoretical basis for their work in this course. But the majority of work in the course will be related to the actual management of assigned development teams. As team managers, COMPSCI 429 students will set goals and schedules for their teams, track and report team progress, negotiate with leaders of other teams and the course customer, and evaluate the work of members of their teams. COMPSCI 429 course assignments may include: written team goals, plans and schedules; periodic reports on team progress; documentation of agreements reached with other team leaders and customers; evaluations of the applicability of theoretical papers to the work of this course. This course will meet at the same times and places as COMPSCI 320. Additional meetings with team members and other students in COMPSCI 429 are also expected to be arranged by mutual agreement. An additional one hour weekly meeting of all of the students in COMPSCI 429 is required. This course counts as a CS Elective for the CS Major. Enrollment in this course is only by permission of the instructor, and is restricted to students who have previously taken COMPSCI 320, and received a grade of B or better. 3 credits.",
    "prerequisites": "N/A",
    "credits": "3"
  },
  {
    "code": "COMPSCI 445",
    "title": "Information Systems",
    "instructors": "Trek Palmer",
    "description": "This course is an introduction to the efficient management of large-scale data. The course includes principles for representing information as structured data, query languages for analyzing and manipulating structured data, and core systems principles that enable efficient computation on large data sets. Classical relational database topics will be covered (data modeling, SQL, query optimization, concurrency control), as well as semi-structured data (XML, JSON), and distributed data processing paradigms (e.g. MapReduce and Spark). Additional application topics may include web application development, data integration, processing data streams, database security and privacy. This course counts as an Elective toward the CS Major. Prerequisite: COMPSCI 220 (or 230) and COMPSCI 311 and COMPSCI 345 with a grade of C or better. 3 credits.",
    "prerequisites": "COMPSCI 220 (or 230) and COMPSCI 311 and COMPSCI 345 with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 446",
    "title": "Search Engines",
    "instructors": "Razieh Rahimi",
    "description": "This course provides an overview of the important issues in information retrieval, and how those issues affect the design and implementation of search engines. The course emphasizes the technology used in Web search engines, and the information retrieval theories and concepts that underlie all search applications. Mathematical experience (as provided by COMPSCI 240) is required. You should also be able to program in Java or Python (other closely related languages may be acceptable). This course counts as a CS Elective for the CS Major. Prerequisite: COMPSCI 240 or COMPSCI 383 with a grade of C or better. 3 credits.",
    "prerequisites": "COMPSCI 240 or COMPSCI 383 with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 453",
    "title": "Computer Networks",
    "instructors": "Arun Venkataramani",
    "description": "This course provides an introduction to fundamental concepts in the design and implementation of computer networks, their protocols, and applications with a particular emphasis on the Internet's TCP/IP protocol suite. Topics to be covered include: overview of network architectures, applications, network programming interfaces (e.g., sockets), transport, congestion, routing, and data link protocols, addressing, local area networks, wireless networks, network security, and network management. There will be five or six homeworks, two programming projects, several hands-on labs (that require an Internet-connected personal computer) and two exams. This course counts as a CS Elective for the CS Major. Prerequisite: Experience programming; COMPSCI 230 (or COMPSCI 377) with a grade of C or better. 3 credits.",
    "prerequisites": "Experience programming; COMPSCI 230 (or COMPSCI 377) with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 466",
    "title": "Applied Cryptography",
    "instructors": "Adam O'Neill",
    "description": "This is an undergraduate-level introduction to cryptography. It is a theory course with a significant mathematical component. However, our viewpoint will be theory applied to practice in that we will aim to treat topics in a way of applied value. We will discuss cryptographic algorithms used in practice and how to reason about their security. More fundamentally, we will try to understand what security is in a rigorous way that allows us to follow sound principles and uncover design weaknesses. The primary topics are: blockciphers, pseudorandom functions, symmetric-key encryption schemes, hash functions, message authentication codes, public-key encryption schemes, digital signature schemes, and public-key infrastructures. This course counts as a CS Elective toward the CS Major. Prerequisite: COMPSCI 311 with a grade of C or better. 3 credits.",
    "prerequisites": "COMPSCI 311 with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 491G",
    "title": "Seminar - Computer Networking Lab",
    "instructors": "Parviz Kermani",
    "description": "In this course, students will learn how to put \"principles into practice,\" in a hands-on-networking lab course. The course will cover router, switches and end-system labs in the areas of Single Segment IP Networks, Multiple Segment IP Networks and Static Routing, Dynamic Routing Protocols (RIP, OSPF and BGP), LAN switching, Transport Layer Protocols: UDP and TCP, NAT, DHCP, DNS, and SNMP. Students will also get engaged in evaluating power consumption of network components as an aid in the design of energy efficient (green) networks. This course counts as a CS Elective for the CS Major. Prerequisite: COMPSCI 453 with a grade of C or better. 3 credits.",
    "prerequisites": "COMPSCI 453 with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 496C",
    "title": "Independent Study - Social Entrepreneurship Launchpad",
    "instructors": "Matthew Rattigan",
    "description": "Social Entrepreneurship Launchpad offers a team-based opportunity to students whoare committed to launching marketable products that contribute to the common good. Teams test the commercial potential of their product ideas and receive mentoring and guidance fromCICS Entrepreneurs in Residence (EIRs) and industry partners to secure funding, build a marketing plan, and consolidate a customer base. The course is open by permission of instructor to students who have successfully completed either completed COMPSCI 420 or have equivalent academic or industry experience. This course does not count as either a CS or INFORM Elective. Prerequisite: COMPSCI 420 with a grade of C or better. 3 credits.",
    "prerequisites": "COMPSCI 420 with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 496D",
    "title": "Indepedent Study - Machine Learning Applied to Child Rescue",
    "instructors": "Brian Levine",
    "description": "Students will work collaboratively to construct production-grade software used to advance the goal of Child Rescue. This course is a group-based, guided independent study. Our goal is to build software that leverages practical machine learning models to be used by professionals dedicated to rescuing children from abuse. Students will be encouraged to design and build their own diagnostic and machine learning tools, while also learning from professionals in the fields of digital forensics and law enforcement. An emphasis is placed on practicing real world professional software engineering skills, such as dealing with limiting scope, productionisation concerns, and working in the presence of poorly defined problems. Students report on their progress each week and typically work in pairs. Attendance is mandatory. This course counts as a CS Elective for the CS Major. 3 credits.",
    "prerequisites": "N/A",
    "credits": "3"
  },
  {
    "code": "COMPSCI 501",
    "title": "Formal Language Theory",
    "instructors": "David Barrington",
    "description": "Introduction to formal language theory. Topics include finite state languages, context-free languages, the relationship between language classes and formal machine models, the Turing Machine model of computation, theories of computability, resource-bounded models, and NP-completeness. This course counts as a CS Elective for the CS Major. Undergraduate Prerequisite: COMPSCI 311 with a grade of C or better. It is recommended that students have a B- or better in 311 in order to attempt 501. 3 credits.",
    "prerequisites": "COMPSCI 311 with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 508",
    "title": "Ethical Considerations in Computing",
    "instructors": "Michelle Trim",
    "description": "This course considers an array of ethical issues in computing. Readings and class discussions will cover ethical questions related to artificial intelligence, privacy online, identity in computing, electronic surveillance, environmental responsibility, internet censorship, network policy, algorithmic systems, information access, ownership of intellectual property in computing contexts and others. All examples will be drawn from current and recent events with readings from a range of sources both journalistic and academic. Course assignments will have real world applications and offer students opportunities for developing their speaking and writing skills. Class discussions will be a vibrant component of the course. This course counts as an Elective for the CS and INFORM Majors. 3 credits.",
    "prerequisites": "N/A",
    "credits": "3"
  },
  {
    "code": "COMPSCI 514",
    "title": "Algorithms for Data Science",
    "instructors": "Andrew McGregor",
    "description": "With the advent of social networks, ubiquitous sensors, and large-scale computational science, data scientists must deal with data that is massive in size, arrives at blinding speeds, and often must be processed within interactive or quasi-interactive time frames. This course studies the mathematical foundations of big data processing, developing algorithms and learning how to analyze them. We explore methods for sampling, sketching, and distributed processing of large scale databases, graphs, and data streams for purposes of scalable statistical description, querying, pattern mining, and learning. This course counts as a CS Elective for the CS Major. Undergraduate Prerequisite: COMPSCI 240 (or STATISTCS 315/515) and COMPSCI 311 both with a grade of B+ or better, or (COMPSCI 240 and STATISTCS 315/515 and COMPSCI 311 and MATH 233 and MATH 235, all with a C or better). 3 credits",
    "prerequisites": "COMPSCI 240 (or STATISTCS 315/515) and COMPSCI 311 both with a grade of B+ or better, or (COMPSCI 240 and STATISTCS 315/515 and COMPSCI 311 and MATH 233 and MATH 235, all with a C or better)",
    "credits": "3"
  },
  {
    "code": "COMPSCI 520",
    "title": "Theory and Practice of Software Engineering",
    "instructors": "Heather Conboy",
    "description": "Introduces students to the principal activities and state-of-the-art techniques involved in developing high-quality software systems. Topics include: requirements engineering, formal specification methods, design principles & patterns, verification & validation, debugging, and automated software engineering. This course counts as a CS Elective for the CS Major. Undergraduate Prerequisite: COMPSCI 320 (or COMPSCI 220 and COMPSCI 326) with a grade of C or better. 3 credits.",
    "prerequisites": "COMPSCI 320 (or COMPSCI 220 and COMPSCI 326) with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 532",
    "title": "Systems for Data Science",
    "instructors": "Peter Klemperer",
    "description": "In this course, students will learn the fundamentals behind large-scale systems in the context of data science. We will cover the issues involved in scaling up (to many processors) and out (to many nodes) parallelism in order to perform fast analyses on large datasets. These include locality and data representation, concurrency, distributed databases and systems, performance analysis and understanding. We will explore the details of existing and emerging data science platforms, including MapReduce-Hadoop, Spark, and more. This course counts as a CS Elective for the CS Major. Undergraduate Prerequisite: COMPSCI 377 and COMPSCI 445 both with a grade of C or better. 3 credits.",
    "prerequisites": "COMPSCI 377 and COMPSCI 445 both with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 535",
    "title": "Computer Architecture",
    "instructors": "Charles Weems",
    "description": "The structure of digital computers is studied at several levels, from the basic logic level, to the component level, to the system level. Topics include: the design of basic components such as arithmetic units and registers from logic gates; the organization of basic subsystems such as the memory and I/O subsystems; the interplay between hardware and software in a computer system; the von Neumann architecture and its performance enhancements such as cache memory, instruction and data pipelines, coprocessors, and parallelism. Semester team project to design an architecture and develop a software simulation of it. This course counts as a CS Elective for the CS Major. Undergraduate Prerequisite: COMPSCI 335 with a grade of C or better. 3 credits.",
    "prerequisites": "COMPSCI 335 with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 546",
    "title": "Applied Information Retrieval",
    "instructors": "Hamed Zamani",
    "description": "COMPSCI 546 is a graduate level course intended to cover information retrieval and other information processing activities, from an applied perspective. There will be numerous programming projects and assignments. It provides a richer technical follow on to COMPSCI 446 (Search Engines) for undergraduates interested in a deeper understanding of the technologies. It also provides a strong basis for continuing on with COMPSCI 646 (Information Retrieval) for those graduate students who are interested in a more complete theoretical coverage of the area. Topics will include: search engine construction (document acquisition, processing, indexing, and querying); learning to rank; information retrieval system performance evaluation; classification and clustering; other machine learning information processing tasks (e.g. basic deep learning models for information retrieval); and many more. This course counts as a CS Elective for the CS Major. Undergraduate Prerequisite: COMPSCI 320 (or COMPSCI 326) and COMPSCI 383 (or COMPSCI 389 or COMPSCI 446 or COMPSCI 485 or COMPSCI 585) all with a grade of C or better. 3 credits.",
    "prerequisites": "COMPSCI 320 (or COMPSCI 326) and COMPSCI 383 (or COMPSCI 389 or COMPSCI 446 or COMPSCI 485 or COMPSCI 585) all with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 561",
    "title": "System Defense and Test",
    "instructors": "Parviz Kermani",
    "description": "This class trains students to detect and analyze weaknesses and vulnerabilities in target systems as a method of assessing the security of a system. We focus on tools and techniques that an attacker would employ but from the perspective of an ethical system administrator. Topics include tools and techniques for penetration testing and attacks, information gathering, social engineering, and defenses. Specific topics include malware, denial of service attacks, SQL injection, buffer overflow, session hijacking, and system hacking, network sniffing and scans, wireless encryption weaknesses and other WiFi issues, IDS/firewall evasion, metasploit tools, physical security, and setting up honeypots. Previously INFOSEC 690S. This course counts as a CS Elective for the CS Major. Undergraduate Prerequisite: COMPSCI 360 (or COMPSCI 460 or COMPSCI 560 or COMPSCI 660 or E&C-ENG 371) and COMPSCI 453 (or E&C-ENG 325), all with a grade of C or better. 3 credits.",
    "prerequisites": "COMPSCI 360 (or COMPSCI 460 or COMPSCI 560 or COMPSCI 660 or E&C-ENG 371) and COMPSCI 453 (or E&C-ENG 325), all with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 564",
    "title": "Cyber Effects: Reverse Engineering, Exploit Analysis, and Capability Development",
    "instructors": "Jeffrey Hamalainen, Seth Landsman, Nick Merlino, Corre Steele, Edward Walters, Adam Woodbury",
    "description": "This course covers a broad range of topics related to cyber security and operations. Our focus is on real world studies of reverse engineering, exploit analysis, and capability development within the context of computer network operations and attack. The course has an emphasis on hands-on exercises and projects. Topics covered include computer architecture and assembly language, principles of embedded security, the essentials of exploit development and analysis (including using industry standard tools such as Ghidra, and utilizing computer security databases such as CVE), and discussion of real-world events and techniques. This course counts as a CS Elective for the CS Major. Undergraduate Prerequisite: COMPSCI 230 (or E&C-ENG 322) and COMPSCI 360 (previously COMPSCI 460 or COMPSCI 365 or COMPSCI 390R or COMPSCI 466 or E&C-ENG 371), all with a grade of C or better. 3 credits.",
    "prerequisites": "COMPSCI 230 (or E&C-ENG 322) and COMPSCI 360 (previously COMPSCI 460 or COMPSCI 365 or COMPSCI 390R or COMPSCI 466 or E&C-ENG 371), all with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 565",
    "title": "Advanced Digital Forensic Systems",
    "instructors": "Peter Klemperer",
    "description": "This course introduces students to the principal activities and state-of-the-art techniques involved in developing digital forensics systems. Topics covered may include: advanced file carving and reconstruction, forensic analysis of modern filesystems, network forensics, mobile device forensics, memory forensics, and anti-forensics. This course counts as a CS Elective for the CS Major. Undergraduate Prerequisite: COMPSCI 365 or COMPSCI 377 with a grade of C or better. 3 credits.",
    "prerequisites": "COMPSCI 365 or COMPSCI 377 with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 571",
    "title": "Data Visualization and Exploration",
    "instructors": "Hamza Mohamed Elhamdadi",
    "description": "In this course, students will learn the fundamental algorithmic and design principles of visualizing and exploring complex data. The course will cover multiple aspects of data presentation including human perception and design theory; algorithms for exploring patterns in data such as clustering, and dimensionality reduction. A wide range of statistical graphics and information visualization techniques will be covered. We will explore numerical data, relational data, temporal data, spatial data, graphs and text. Hands-on projects will be based on Python or JavaScript with D3. This course counts as an Elective toward the CS and INFORM Majors. Undergraduate Prerequisite: COMPSCI 220, or COMPSCI 230, or COMPSCI 326 with a grade of C or better. No prior knowledge of data visualization or exploration is assumed. 3 credits.",
    "prerequisites": "COMPSCI 220, or COMPSCI 230, or COMPSCI 326 with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 589",
    "title": "Machine Learning",
    "instructors": "Bruno Castro da Silva,",
    "description": "This course will introduce core machine learning models and algorithms for classification, regression, clustering, and dimensionality reduction. On the theory side, the course will focus on effectively using machine learning methods to solve real-world problems with an emphasis on model selection, regularization, and empirical evaluation. The assignments will involve both mathematical problems and implementation tasks. Knowledge of a high-level programming language is absolutely necessary. Python is most commonly used (along with standard libraries such as numpy, scipy, and scikit-learn), but languages such as Matlab, R, Scala, Julia would also be suitable. While this course has an applied focus, it still requires appropriate mathematical background in probability and statistics, calculus, and linear algebra. The prerequisites for undergrads were previously COMPSCI 383 and MATH 235 (COMPSCI 240 provides sufficient background in probability, and MATH 131/132 provide sufficient background in calculus). Graduate students can check the descriptions for these courses to verify that they have sufficient mathematical background for 589. Strong foundations in linear algebra, calculus, probability, and statistics are essential for successfully completing this course. Graduate students from outside computer science with sufficient background are also welcome to take the course. This course counts as a CS Elective for the CS Major. Undergraduate Prerequisite: MATH 545 and COMPSCI 240 and STATISTC 315/515 all with a grade of C or better. (MATH 545 can be skipped by students who have taken MATH 235 and MATH 233 both with B+ or better. STATISTC 315/515 can be skipped by students who have taken COMPSCI 240 with a B+ or better). 3 credits.",
    "prerequisites": "MATH 545 and COMPSCI 240 and STATISTC 315/515 all with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 590AB",
    "title": "Quantum Cryptography",
    "instructors": "Filip Rozpedek",
    "description": "The ability to transmit quantum information over long distances will enable implementation of many fascinating quantum communication tasks and provide us with novel capabilities that reach beyond what we can do over classical Internet alone. Examples of such tasks include blind quantum computing, clock synchronization or distributed quantum computing. Quantum cryptography is one family of such tasks with the most famous one being quantum key distribution. This task, which is currently the most mature quantum technology, enables distribution of shared keys through a protocol that is information-theoretically secure and whose security remarkably is guaranteed by the laws of quantum physics. Such unconditional security cannot be achieved in the classical world. In this course we will introduce the world of quantum cryptographic protocols and describe how the power of quantum mechanics can enable distribution of shared secret keys even with untrusted devices. It will also introduce many other fascinating quantum protocols beyond quantum key distribution. The course will meet jointly with the course 690BB which covers the same material. Unlike 690BB this course does not include a project as one of the assessment components and it puts more grade weight on the homework. Students who take this course cannot simultaneously, nor later, enroll in 690BB. This course counts as a CS Elective for the CS Major. Undergraduate Prerequisite: MATH 132 and MATH 235 and COMPSCI 240 (or STATISTC 315/515 or PHYSICS 281 or PHYSICS 287) all with a grade of C or better. 3 credits",
    "prerequisites": "MATH 132 and MATH 235 and COMPSCI 240 (or STATISTC 315/515 or PHYSICS 281 or PHYSICS 287) all with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 590AE",
    "title": "Mobile and Wireless Networks",
    "instructors": "James Kurose",
    "description": "This course covers wireless networking and mobility principles and practice. The focus of \"practice\" is primarily 802.11 (WiFi) and 4G/5G cellular networks. Unlike many other wireless networking courses, this course focuses primarily on the networking and systems aspects of wireless and mobile networks, rather than on the wireless channel aspects. This course counts as a CS Elective for the CS Major. Undergraduate Prerequisite: COMPSCI 453 or E&C-ENG 374 with a grade of C or better. 3 credits.",
    "prerequisites": "COMPSCI 453 or E&C-ENG 374 with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 590AF",
    "title": "Reverse Engineering and Understanding Exploit Development",
    "instructors": "Lurene Grenier",
    "description": "Many software developers aren't aware of how to properly write secure code. This course covers practical skills in reverse engineering and binary exploitation, and examines the techniques used by malicious adversaries in major security incidents. The course objective is to provide students with a strong understanding of attack patterns, and to ensure students implement more secure coding practices in their own code. This course begins with an introduction to Intel-based assembly, reverse engineering, vulnerability analysis, and various forms of Linux-focused binary exploitation. The course then covers stack, heap and Linux kernel-based exploitation, and dive into common defensive mitigations such as ASLR, NX and Stack Cookies alongside techniques to bypass each of them. This course counts as a CS Elective for the CS Major. Undergraduate Prerequisite: COMPSCI 230 (or E&C-ENG 322) with a grade of C or better. 3 credits.",
    "prerequisites": "COMPSCI 230 (or E&C-ENG 322) with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 590QC",
    "title": "Quantum Communication",
    "instructors": "Gayane Vardoyan",
    "description": "This course will provide an introduction to fundamental principles underlying quantum communication, including quantum repeaters, entanglement, and other tools needed for the implementation of distributed quantum protocols. Topics include: basics of quantum computation and information; modeling and coping with noise in quantum systems; entanglement generation schemes; quantum Internet and its applications. This course counts as a CS Elective for the CS Major. Undergraduate Prerequisite: MATH 235 and COMPSCI 240 (or STATISTC 315/515), both with a grade of C or better. 3 credits",
    "prerequisites": "MATH 235 and COMPSCI 240 (or STATISTC 315/515), both with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "COMPSCI 596C",
    "title": "Independent Study - Complexity Theory",
    "instructors": "David Barrington",
    "description": "Group study of the textbook \"Computational Complexity: A Modern Approach\" by Arora and Barak. Students will prepare and present material from this book in each lecture, on a rotating basis. Evaluation will be based on the individual presentations -- no exams, possible problem sets. Does not count toward the CS or INFORM Major. 3 credits.",
    "prerequisites": "N/A",
    "credits": "3"
  },
  {
    "code": "COMPSCI 596E",
    "title": "Independent Study - Machine Learning Applied to Child Rescue",
    "instructors": "Brian Levine",
    "description": "Students will work collaboratively to construct production-grade software used to advance the goal of Child Rescue. This course is a group-based, guided independent study. Our goal is to build practical machine learning models to be used by professionals dedicated to rescuing children from abuse. Students will be encouraged to design and build their own diagnostic and machine learning tools, while also learning from professionals in the fields of digital forensics and law enforcement. An emphasis is placed on practicing real world professional software engineering skills, such as dealing with limiting scope, productionisationconcerns, and working in the presence of poorly defined problems. The entire student group will meet once a week to share progress via short presentations. Open to senior Computer Science majors, MS-CMPSCI majors, and CS PhD students. 3 credits",
    "prerequisites": "N/A",
    "credits": "3"
  },
  {
    "code": "COMPSCI 603",
    "title": "Robotics",
    "instructors": "Hao Zhang",
    "description": "This course is intended to serve as an advanced overview of robotics spanning the complete autonomy loop: perception, planning, and control. We will study the theory, algorithms, and efficient implementations related to these topics, with focus on open discussions for how to do research to go beyond the state of the art. Students will gain hands-on experience in implementing, and extending such algorithms using simulations. 3 credits.",
    "prerequisites": "N/A",
    "credits": "3"
  },
  {
    "code": "COMPSCI 611",
    "title": "Advanced Algorithms",
    "instructors": "Hedyeh Beyhaghi",
    "description": "Principles underlying the design and analysis of efficient algorithms. Topics to be covered include: divide-and-conquer algorithms, graph algorithms, matroids and greedy algorithms, randomized algorithms, NP-completeness, approximation algorithms, linear programming. Open to graduate Computer Science students only. Prerequisite: The mathematical maturity expected of incoming Computer Science graduate students, knowledge of algorithms at the level of COMPSCI 311. 3 credits.",
    "prerequisites": "The mathematical maturity expected of incoming Computer Science graduate students, knowledge of algorithms at the level of COMPSCI 311",
    "credits": "3"
  },
  {
    "code": "COMPSCI 627",
    "title": "Fixing Social Media",
    "instructors": "Ethan Zuckerman",
    "description": "Over the past decade, user-generated participatory media social media has emerged as the dominant model for content of the Internet. From Facebook to Twitter, YouTube to Wikipedia, content created by non-professionals and circulated for commercial and non-commercial motives underpins seven of the top 10 websites in the US, and has become an increasingly important component of the news ecosystem. While social media was initially hailed as a powerful tool for broadening civic participation, many problems have emerged with the rise of the medium, from questions of whether social media usage is bad for our individual mental health, to whether the fabric of our democracy is being damaged by disinformation, fragmentation and hyperpolarization. As legislators look to regulate these platforms and commentators propose shutting them down entirely, this course looks for an alternative: affirmative visions of social media that are good for individuals and society, which we could work towards building. This class examines possible problems with existing modes of social media, discusses ways in which social media could be a benefit to individuals and societies, develops case studies of successful and healthy online communities, and ultimately designs and builds tools to improve existing social media systems or replace them with novel models. Students will write reflectively about weekly readings and discussions and participate in multi-week projects, ultimately building teams to work on final projects. Meets with COMM 627 and SPP 627. 3 credits.",
    "prerequisites": "N/A",
    "credits": "3"
  },
  {
    "code": "COMPSCI 645",
    "title": "Database Design and Implementation",
    "instructors": "Marco Serafini",
    "description": "This course covers the design and implementation of traditional relational database systems as well as advanced data management systems. The course will treat fundamental principles of databases such as the relational model, conceptual design, and schema refinement. We will also cover core database implementation issues including storage and indexing, query processing and optimization, and transaction management. Additionally, we will address challenges in modern information systems, including scalability and parallelization, big data systems, cloud databases, dealing with graph and vector data, and the integration of database management systems and machine learning. 3 credits.",
    "prerequisites": "N/A",
    "credits": "3"
  },
  {
    "code": "COMPSCI 651",
    "title": "Optimization in Computer Science",
    "instructors": "Madalina Fiterau Brostean",
    "description": "Much recent work in computer science in a variety of areas, from game theory to machine learning and sensor networks, exploits sophisticated methods of optimization. This course is intended to give students an in-depth background in both the foundations as well as some recent trends in the theory and practice of optimization for computer science. The Optimization course covers these topics, which are critical to a large number of research projects conducted within the department. 3 credits.",
    "prerequisites": "N/A",
    "credits": "3"
  },
  {
    "code": "COMPSCI 677",
    "title": "Distributed and Operating Systems",
    "instructors": "Prashant Shenoy",
    "description": "This course provides an in-depth examination of the principles of distributed systems and advanced concepts in operating systems. Covered topics include client-server programming, distributed scheduling, virtualization, cloud computing, distributed storage, security in distributed systems, distributed middleware, ubiquitous computing, and applications such as the Internet of Things, Web and peer-to-peer systems. Prerequisites: Students should be able to easily program in a high-level language such as Java, C++ or Python, have had a course on data structures, be familiar with elements of computer architecture and have had previous exposure to the operating system concepts of processes, virtual memory, and scheduling. A previous course on uniprocessor operating systems (e.g., COMPSCI 377) will be helpful but not required. 3 credits.",
    "prerequisites": "Students should be able to easily program in a high-level language such as Java, C++ or Python, have had a course on data structures, be familiar with elements of computer architecture and have had previous exposure to the operating system concepts of processes, virtual memory, and scheduling",
    "credits": "3"
  },
  {
    "code": "COMPSCI 682",
    "title": "Neural Networks: A Modern Introduction",
    "instructors": "Chuang Gan",
    "description": "This course will focus on modern, practical methods for deep learning with neural networks. The course will begin with a description of simple classifiers such as perceptrons and logistic regression classifiers, and move on to standard neural networks, convolutional neural networks, some elements of recurrent neural networks, and transformers. The emphasis will be on understanding the basics and on practical application more than on theory. Many applications will be in computer vision, but we will make an effort to cover some natural language processing (NLP) applications as well.The current plan is to use Python and associated packages such as Numpy and Pytorch. Required background includes Linear Algebra, Probability and Statistics, and Multivariate Calculus. All assignments will be in the Python programming language. Open to graduate Computer Science students only. 3 credits.",
    "prerequisites": "N/A",
    "credits": "3"
  },
  {
    "code": "COMPSCI 683",
    "title": "Artificial Intelligence",
    "instructors": "Yair Zick",
    "description": "In-depth introduction to Artificial Intelligence focusing on techniques that allow intelligent systems to reason effectively with uncertain information and cope limited computational resources. Topics include: problem-solving using search, heuristic search techniques, constraint satisfaction, local search, abstraction and hierarchical search, resource-bounded search techniques, principles of knowledge representation and reasoning, logical inference, reasoning under uncertainty, belief networks, decision theoretic reasoning, representing and reasoning about preferences, planning under uncertainty using Markov decision processes, multi-agent systems, and computational models of bounded rationality. 3 credits.",
    "prerequisites": "N/A",
    "credits": "3"
  },
  {
    "code": "COMPSCI 685",
    "title": "Advanced Natural Language Processing",
    "instructors": "Haw-Shiuan Chang",
    "description": "This course will broadly deal with deep learning methods for natural language processing, with a specific focus on large language models. Most of the semester will focus on neural language models. It is intended for graduate students in computer science and linguistics who are (1) interested in learning about cutting-edge research progress in NLP and (2) familiar with machine learning fundamentals. We will cover modeling architectures, training objectives, and downstream tasks (e.g., text classification, question answering, and text generation). Coursework includes programming assignments and a final project. 3 credits.",
    "prerequisites": "N/A",
    "credits": "3"
  },
  {
    "code": "COMPSCI 690BB",
    "title": "Quantum Cryptography",
    "instructors": "Filip Rozpedek",
    "description": "The ability to transmit quantum information over long distances will enable implementation of many fascinating quantum communication tasks and provide us with novel capabilities that reach beyond what we can do over classical Internet alone. Examples of such tasks include blind quantum computing, clock synchronization or distributed quantum computing. Quantum cryptography is one family of such tasks with the most famous one being quantum key distribution. This task, which is currently the most mature quantum technology, enables distribution of shared keys through a protocol that is information-theoretically secure and whose security remarkably is guaranteed by the laws of quantum physics. Such unconditional security cannot be achieved in the classical world. In this course we will introduce the world of quantum cryptographic protocols and describe how the power of quantum mechanics can enable distribution of shared secret keys even with untrusted devices. It will also introduce many other fascinating quantum protocols beyond quantum key distribution. The course will meet jointly with the course 590AB which covers the same material. Unlike 590AB this course includes a project as one of the assessment components and it puts less grade weight on the homework. Students who take this course cannot simultaneously, nor later, enroll in 590AB. 3 credits.",
    "prerequisites": "N/A",
    "credits": "3"
  },
  {
    "code": "COMPSCI 690G",
    "title": "Security for Large-Scale Systems",
    "instructors": "Pubali Datta",
    "description": "This course provides an in-depth examination of the issues in system security, and assumes prior knowledge of operating system concepts. We will start with learning the classic approaches to security attacks and defenses from the perspective of a single host system. Topics include access control, information flow control, system auditing, privilege separation, security policies, host-based intrusion detection etc. Then we will study how these classic mechanisms are expanded and adapted to modern distributed system platforms such as cloud platforms, Internet of Things platforms, and large enterprises. 3 credits.",
    "prerequisites": "N/A",
    "credits": "3"
  },
  {
    "code": "COMPSCI 690QC",
    "title": "Quantum Communication",
    "instructors": "Gayane Vardoyan",
    "description": "This course will provide an introduction to fundamental principles underlying quantum communication, including quantum repeaters, entanglement, and other tools needed for the implementation of distributed quantum protocols. Topics include: basics of quantum computation and information; modeling and coping with noise in quantum systems; entanglement generation schemes; quantum Internet and its applications. 3 credits",
    "prerequisites": "N/A",
    "credits": "3"
  },
  {
    "code": "COMPSCI 690R",
    "title": "Computing for Digital Biomarkers in Healthcare",
    "instructors": "Sunghoon Lee",
    "description": "Computer science has played a pivotal role in developing innovative technologies to monitor patients' health conditions beyond the traditional laboratory or clinical environments. The development of clinically valid digital biomarkers can enable a wide range of applications, including the implementation of targeted behavioral interventions to drive substantial improvements in health-related outcomes, monitoring the progress of individuals undergoing interventions, and assessing the efficacy of emerging therapeutic interventions as an endpoint. In this course, we will delve into the application of machine learning and mobile technologies in the development of digital biomarkers. Focusing on its application in the analysis of human movements, behaviors, and behavioral phenotypes, the course curriculum will encompass the fundamentals of human movement analysis, mobile and wearable sensing technologies to support remote human movement monitoring, fundamentals of signal processing techniques, and state-of-the-art machine learning techniques, all with the overarching goal of developing a reliable, responsive, and valid digital biomarker for motor deficits. In addition, we will cover essential topics such as human subject study design (e.g., randomized controlled trials) and hypothesis testing (e.g., t-test, ANOVA, correlation test, etc.). These skills are crucial for their application within the realm of clinical sciences, especially when it comes to assessing the effectiveness of emerging healthcare and wellness technologies. This course contains lectures, assignments, a final project, paper presentations, and critical discussions. 3 credits.",
    "prerequisites": "N/A",
    "credits": "3"
  },
  {
    "code": "COMPSCI 690U",
    "title": "Computational Biology and Bioinformatics",
    "instructors": "Anna Green",
    "description": "This course is designed to provide computer scientists with a comprehensive introduction to the field of computational biology. The course will cover the application of computational techniques to modern research challenges in biology, discussing both foundational algorithms and newly introduced methods. The necessary background on biology will be provided in order to contextualize the methods. The primary focus will be analysis of genomic data, including variant calling, genome annotation, sequence search, sequence alignment, phylogeny construction, mutation effect prediction, population genetics, and genotype-phenotype association studies. We will also cover protein structure analysis and prediction. Throughout the course, we will emphasize the unique challenges to working with biological data. Through lectures and hands-on programming problem sets, students will develop the necessary skills to tackle computational challenges in the field of biology. 3 credits.",
    "prerequisites": "N/A",
    "credits": "3"
  },
  {
    "code": "COMPSCI 691O",
    "title": "Seminar - Tools for Explanatory and Tutoring Systems",
    "instructors": "Beverly Woolf",
    "description": "Artificial Intelligence will radically change education. Through machine learning, data mining, analytics, robotics, and user models, AI will replace false learning boundaries (e.g., learning places, time, level of study); personalize learning; make learning instantly available to everyone; connect learners with partners; provide multi-media; and augment human learning ability. This seminar examines recent work in explanatory and tutoring systems, presents theories about digital teaching and learning, and describes how to deliver personalized teaching in online systems. Such software supports people working alone or in collaborative inquiry to rapidly access and integrate global information. This course describes how to build tutors, stimulates awareness of research issues, and promotes sound analytic and design skills. Specific topics include systems that support collaboration, inquiry, natural language dialogue, authoring tools and user models. The course is appropriate for students from many disciplines (e.g., computer science, linguistics, education, and psychology), researchers, and practitioners from academia, industry, and government. No programming is required. Students will read and critique papers about AI tools (e.g., vision, natural language), methods, and will study the complexity of human learning through advances in cognitive science. Weekly assignments invite students to critique the literature and a final project requires a detailed specification (not a program) for a tutor on your chosen topic. Students present readings from the research literature and several working systems will be available for hands-on or virtual critique. 3 credits.",
    "prerequisites": "N/A",
    "credits": "3"
  },
  {
    "code": "COMPSCI 692DQ",
    "title": "Seminar - Topics in Distributed Quantum Computing",
    "instructors": "Donald Towsley, Gayane Vardoyan",
    "description": "This seminar focuses on distributed quantum computing (DQC). Topics include but are not limited to circuit knitting; architectures and platforms suitable for DQC; fault tolerance, magic state distillation, and quantum error correcting codes for DQC; applications that can be supported with DQC; the effects of topology and limited interconnectivity; the role of entanglement in DQC; cloud-based quantum computation with remote clients; resource management and scheduling. All students taking the seminar for credit will be expected to present papers on these topics and to participate in classroom discussion. Students taking the seminar for 3 credits will be expected to propose and complete a project. The main objective of this seminar is to bring everyone, including instructors, up to speed regarding the state of the art in distributed quantum computation. 1-3 credits.",
    "prerequisites": "N/A",
    "credits": "3"
  },
  {
    "code": "COMPSCI 692EF",
    "title": "Seminar - Embedded Models for IoT and Health",
    "instructors": "Deepak Ganesan, Phuc Nguyen",
    "description": "The deployment of foundation models in resource-constrained mobile and wearable devices presents unique challenges and opportunities, particularly in health and wearable sensing applications. This advanced seminar explores the cutting-edge intersection of large AI models, embedded systems, and digital health, with a focus on real-world applications in wearable and mobile biosignal sensing platforms. The course examines two primary themes: (1) the application of foundation models in multimodal biosignal sensing contexts, including real-time physiological monitoring, neural signal processing, behavioral understanding, and clinical decision support through wearable devices such as EEG headsets, smartwatches, smart rings, eyewear, and earables; and (2) the technical challenges and solutions for deploying these powerful models on resource-constrained devices, including model compression, efficient inference, on-device learning, and real-time processing requirements. Example topics will include: Application Domains in Health and Wearables, Systems Optimizations and Architecture, IoT Applications and Environments. The course will primarily consist of paper readings, presentations, and discussions. Students will critically examine recent advances in the field through both academic papers and industry developments. For 3-credit option, a semester-long research project is required, involving either the development of a novel application using foundation models on wearable platforms or the implementation of optimization techniques for embedded deployment. 1-3 credits.",
    "prerequisites": "N/A",
    "credits": "3"
  },
  {
    "code": "COMPSCI 692L",
    "title": "Seminar - Natural Language Processing",
    "instructors": "Brendan O'Connor",
    "description": "Weekly seminar requiring students to read an NLP paper and discuss and review it from a variety of perspectives. Some weeks will feature invited speakers instead of paper reviews. 1 credit.",
    "prerequisites": "N/A",
    "credits": "1"
  },
  {
    "code": "COMPSCI 692PA",
    "title": "Seminar - Advanced Topics on Privacy and Security for Generative Models",
    "instructors": "Eugene Bagdasarian",
    "description": "New capabilities of language and diffusion models enable applications that interact with users across different modalities, perform independent actions, and leverage external tools. In the seminar, we will study how these capabilities create new privacy and security challenges by analyzing recent papers in ML and S&P communities and connecting discovered problems to fundamental issues from previous decades. As part of the course there will be an opportunity to conduct a research project that goes deeper into these problems. 1 credit.",
    "prerequisites": "N/A",
    "credits": "1"
  },
  {
    "code": "COMPSCI 696DS",
    "title": "Independent Study - Data Science",
    "instructors": "Andrew McCallum",
    "description": "The goal of this course is to provide Professional Masters students withindustry mentorship and real-world data science training.Beyond-classroom educational opportunities are an excellent way to gain practical experience on a substantial project, to learn advanced skills, to collaborate with a professional PhD researcher, to form a connection to a data science company, and to work in a team with other graduate students.Industry partners propose semester-long data science projects.Students form three-to-five-person teams, each of which work on one project throughout the semester, under the guidance of their industry mentor, additional PhD student mentors, and the course faculty instructor.Furthermore, in weekly class meetings all students receive professional development education, data science hardware and software infrastructure training, data science research presentations, and career advice.Student teams gain valuable oral presentation experience and feedback by regularly presenting their work-in-progress, as well as a final public presentation of their project at the end of the semester.Advantages of these industry relationships often include access to rich industry-scale data, learning about real-world problems, and making industry connections useful for the future. Prerequisites: Enrollment in the CICS Professional Masters Program; by the end of previous semester have completed at least two of the Data Science core requirements; a grade point average of 3.0 or higher. 3 credits.",
    "prerequisites": "Enrollment in the CICS Professional Masters Program; by the end of previous semester have completed at least two of the Data Science core requirements; a grade point average of 3",
    "credits": "3"
  },
  {
    "code": "COMPSCI 879",
    "title": "Teaching Assistants as Tomorrow's Faculty",
    "instructors": "Ivon Arroyo",
    "description": "Teaching Assistants as Tomorrow's Faculty prepares Teaching Assistants (TAs) at the College of Information and Computer Sciences to fulfill their duties in an effective and pedagogically sound manner. The two credit (not repeatable) course is semester long and taken by all TAs prior to assuming assistantship. 2 credits.",
    "prerequisites": "N/A",
    "credits": "2"
  },
  {
    "code": "COMPSCI 891M",
    "title": "Seminar - Theory of Computation",
    "instructors": "Yair Zick",
    "description": "The theory seminar is a weekly meeting in which topics of interest in the theory of computation - broadly construed - are presented. This is sometimes new research by visitors or local people. It is sometimes work in progress, and it is sometimes recent material of others that some of us present in order to learn and share. This seminar may be taken repeatedly for credit up to six times. 1 credit.",
    "prerequisites": "N/A",
    "credits": "1"
  },
  {
    "code": "COMPSCI H311",
    "title": "Honors Colloquium for Introduction to Algorithms",
    "instructors": "Marius Minea",
    "description": "The design and analysis of efficient algorithms for important computational problems. Emphasis on the relationships between algorithms and data structures and on measures of algorithmic efficiency. Advanced graph algorithms, dynamic programming applications, NP-completeness and space complexity, approximation and randomized algorithms. Experimental analysis of algorithms also emphasized. Use of computer required. Prerequisite: CICS 210 (or COMPSCI 187) and COMPSCI 250 (or MATH 455) all with a grade of C or better (or COMPSCI 311 with a grade of B or better). 1 credit.",
    "prerequisites": "CICS 210 (or COMPSCI 187) and COMPSCI 250 (or MATH 455) all with a grade of C or better (or COMPSCI 311 with a grade of B or better)",
    "credits": "1"
  },
  {
    "code": "COMPSCI H345",
    "title": "Honors Colloquium for Practice and Applications of Data Management",
    "instructors": "Gordon Anderson",
    "description": "Students will study in depth data management topics covered in class. Activities include discussions with the professor and TA, readings, and a project. The project is a semester-long group activity that combines several advanced topics into a practical application. Prerequisite: CS MAJORS: CICS 210 (or COMPSCI 187) with a grade of C or better (or COMPSCI 345 with a grade of B or better); INFORM MAJORS: INFO 248 and CICS 160 (previously INFO 190T or COMPSCI 186 or COMPSCI 187), all with a grade of C or better (or COMPSCI 345 with a grade of B or better). 1 credit.",
    "prerequisites": "CS MAJORS: CICS 210 (or COMPSCI 187) with a grade of C or better (or COMPSCI 345 with a grade of B or better); INFORM MAJORS: INFO 248 and CICS 160 (previously INFO 190T or COMPSCI 186 or COMPSCI 187), all with a grade of C or better (or COMPSCI 345 with a grade of B or better)",
    "credits": "1"
  },
  {
    "code": "INFO 150",
    "title": "A Mathematical Foundation for Informatics",
    "instructors": "Chloe Becquey",
    "description": "Mathematical techniques useful in the study of computing and information processing. The mathematical method of definition and proof. Sets, functions, and relations. Combinatorics, probability and probabilistic reasoning. Graphs and trees as models of data and of computational processes. Prerequisite: R1 math skills recommended. Not intended for Computer Science majors students interested in a majors-level treatment of this material should see COMPSCI 240 and 250 (or MATH 455). 3 credits.",
    "prerequisites": "R1 math skills recommended",
    "credits": "3"
  },
  {
    "code": "INFO 203",
    "title": "A Networked World",
    "instructors": "Mohammadhassan Hajiesmaili",
    "description": "The course will cover the technical foundations of today s communication networks, particularly the Internet. It will also address key social, policy, economic and legal aspects of these networks, their use (and abuse), and their regulation. This course covers computer science topics, but all material will be presented in a way that is accessible to an educated audience with or without a strong technical background. Not intended for Computer Science majors students interested in a CS majors-level treatment of this material should see COMPSCI 453. 3 credits.",
    "prerequisites": "N/A",
    "credits": "3"
  },
  {
    "code": "INFO 248",
    "title": "Introduction to Data Science",
    "instructors": "Gordon Anderson",
    "description": "This course is an introduction to the concepts and skills involved with the collection, management, analysis, and presentation of data sets and the data products that result from the work of data scientists. Privacy, algorithmic bias and ethical issues are also discussed. Students will work with data from the financial, epidemiological, educational, and other domains. The course provides examples of real-world data that students work with using various software tools. This course consists of two lecture meetings and one lab meeting per week. Readings will be assigned as preparation for each class meeting. A semester project will be assigned. Students work in pairs to develop their project over the semester. The project provides students with an opportunity to work collaboratively to explore the topics in more depth in a specialized domain. A midterm and final exam will be given. Grades are determined by a combination of scores on lab activities, projects, and exam scores. Software: all software is freely available. Open to INFORM majors. Prerequisite: a grade of C or or above in the following courses: CICS 110 (or CICS 160 or COMPSCI 119 or COMPSCI 121) with a grade of C or above and either: PSYCH 240, OIM 240, STATISTC 240, RES-ECON 212, SOCIOL 212, OR STATISTC 315/515, OR COMPSCI 240, with a grade of C or above. 4 credits.",
    "prerequisites": "a grade of C or or above in the following courses: CICS 110 (or CICS 160 or COMPSCI 119 or COMPSCI 121) with a grade of C or above and either: PSYCH 240, OIM 240, STATISTC 240, RES-ECON 212, SOCIOL 212, OR STATISTC 315/515, OR COMPSCI 240, with a grade of C or above",
    "credits": "4"
  },
  {
    "code": "INFO 348",
    "title": "Data Analytics with Python",
    "instructors": "Jayant Taneja",
    "description": "The modern world is awash with data, and making sense of it requires specialized skills. This course will expose students to commonly used data analytics techniques. Topics include the acquisition, manipulation, and transformation of structured data, exploratory data analysis, data visualization, and predictive modeling. Students in this course will learn and use the Python programming language and tools for working with data. Analysis will be performed using real data sets. Does not count as a CS Elective (BA or BS). Satisfies one of the Data Science Concentration requirements and counts as an elective for the Health and Life Sciences Concentration for the Informatics major. Open to INFORM majors. Prerequisite: INFO 248 and CICS 160 (or INFO 190T or COMPSCI 186 or 187), both with a grade of C or better. 3 credits.",
    "prerequisites": "INFO 248 and CICS 160 (or INFO 190T or COMPSCI 186 or 187), both with a grade of C or better",
    "credits": "3"
  },
  {
    "code": "INFO 490PI",
    "title": "Personal Health Informatics",
    "instructors": "Ravi Karkar",
    "description": "This course will cover the design of personal health and wellness technologies. Using the personal health informatics model, we will learn various challenges in designing technologies for personal health data collection (e.g., step count, heart rate, or food intake etc.), integration, self-reflection, and behavior change. Going further, students will understand design issues in sharing personal health data and discuss design guidelines for collaborative data collection, reflection, and care. It is difficult to create health technologies that can successfully be integrated into people s daily life due to many obstacles in individuals data collection, integration, self-reflection, and sharing practices. Understanding these challenges is an important part of designing Health Technologies. Therefore, this course will cover HCI and design thinking methods that students can leverage to understand the adoption and use of Health Technologies and to design effective Health Technologies. Moreover, visualizations facilitate people to gain insights from their data, so we will cover common visualization approaches used in the personal data contexts. Students will apply the design issues taught during lecture to a team-based semester-long personal health application design project. This course satisfies the IE requirement for Informatics majors and it also counts as an elective for all concentrations of the Informatics major. Prerequisite: INFO 248 (or COMPSCI 240) and CICS 210 (or COMPSCI 186 or COMPSCI 187)all with a grade of C or better. 4 credits.",
    "prerequisites": "INFO 248 (or COMPSCI 240) and CICS 210 (or COMPSCI 186 or COMPSCI 187)all with a grade of C or better",
    "credits": "4"
  },
  {
    "code": "INFO H490PI",
    "title": "Honors Colloquium for Personal Health Informatics",
    "instructors": "Ravi Karkar",
    "description": "This colloquium will dive deeper into issues related to design of personal health technologies. You will study examples of existing platforms, read relevant publications, and will produce a critical reflection on the state and future direction of the field.",
    "prerequisites": "N/A",
    "credits": "N/A"
  }
]